





AAA Working Group                                         Pat R. Calhoun
Internet-Draft                                     Sun Microsystems, Inc.
Category: Standards Track                                  Haseeb Akhtar
<draft-ietf-aaa-diameter-03.txt>                         Nortel Networks
                                                              Jari Arkko
                                                       Oy LM Ericsson Ab
                                                            Erik Guttman
                                                  Sun Microsystems, Inc.
                                                         Allan C. Rubens
                                                       Tut Systems, Inc.
                                                               Glen Zorn
                                                     Cisco Systems, Inc.
                                                                May 2001



                         Diameter Base Protocol



Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at:

      http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at:

      http://www.ietf.org/shadow.html.

   Distribution of this memo is unlimited.

   Copyright   (C) The Internet Society 2001.  All Rights Reserved.

Abstract

   The Diameter base protocol is intended to provide a AAA framework for



Calhoun et al.            expires October 2001                  [Page 1]





Internet-Draft                                                  May 2001


   Mobile-IP, NASREQ and ROAMOPS. This draft specifies the message
   format, transport, error reporting and security services to be used
   by all Diameter extensions and MUST be supported by all Diameter
   implementations.















































Calhoun et al.            expires October 2001                  [Page 2]





Internet-Draft                                                  May 2001


Table of Contents

      1.0  Introduction
            1.1  Diameter Protocol
            1.2  Requirements language
            1.3  Terminology
      2.0  Protocol Overview
            2.1  Transport
            2.2  Securing Diameter Messages
            2.3  Diameter Protocol Extensibility
                  2.3.1  Defining new AVP Values
                  2.3.2  Creating new AVPs
                  2.3.3  Creating a new Diameter extension
                  2.3.4  Extension authentication procedures
            2.4  Diameter Extensions
            2.5  Diameter Server Discovery
      3.0  Diameter Header
            3.1  Command Code Definitions
            3.2  Command Code ABNF specification
            3.3  Diameter Command Naming Conventions
                  3.3.1  Request/Answer
                  3.3.2  Query/Response
                  3.3.3  Indication
      4.0  Diameter AVPs
                  4.1  AVP Header
                  4.2  Optional Header Elements
                  4.3  AVP Data Formats
                  4.4  Grouped AVP Values
                     4.4.1  Example AVP with a Grouped Data type
                  4.5  Diameter Base Protocol AVPs
      5.0  Message Forwarding
            5.1  Origin-FQDN AVP
            5.2  Origin-Realm AVP
            5.3  Destination-FQDN AVP
      6.0  Capabilities Negotiation
            6.2  Device-Reboot-Ind (DRI) Command
                  6.2.1  Vendor-Id AVP
                  6.2.2  Firmware-Revision AVP
                  6.2.3  Auth-Extension-Id AVP
                  6.2.4  Host-IP-Address AVP
                  6.2.5  Supported-Vendor-Id AVP
                  6.2.6  Product-Name AVP
                  6.2.7  Acct-Extension-Id AVP
      7.0  Transport Failure Detection
            7.1  Device-Watchdog-Request
            7.2  Device-Watchdog-Answer
            7.3  Failover/Failback Procedures
      8.0  Peer State Machine



Calhoun et al.            expires October 2001                  [Page 3]





Internet-Draft                                                  May 2001


            8.1  States
            8.2  Events
            8.3  Actions
            8.4  The Election Process
      9.0  Per-Hop Error Signaling
            9.1  Device-Status-Ind
                  9.1.1  DSI-Event AVP
                        9.1.1.1  Informational Events
                        9.1.1.2  Redirect Event
                        9.1.1.3  Transient Failure Events
                        9.1.1.4  Permanent Failure Events
      10.0  End-to-End Error Signaling
            10.1  Message-Reject-Ind (MRI) Command
                  10.1.1  Failed-AVP AVP
                  10.1.2  Failed-Command-Code AVP
                  10.1.3  Offending-Command-Code AVP
                  10.1.4  Offending-AVP AVP
                  10.1.5  Failed-Vendor-Id AVP
            10.2  Result-Code AVP
                  10.2.1  Informational
                  10.2.2  Success
                  10.2.3  Transient Failures
                  10.2.4  Permanent Failures
            10.3  Error-Message AVP
            10.4  Error-Reporting-FQDN AVP
      11.0  "User" Sessions
            11.1  Authorization Session State Machine
            11.2  Accounting Session State Machine
            11.3  Session-Id AVP
            11.4  Authorization-Lifetime AVP
            11.5  Session-Timeout AVP
            11.6  User-Name AVP
            11.7  Max-Wait-Time AVP
            11.8  Session Movement
                  11.8.1  Original-Session-Id AVP
            11.9  Session Termination
                  11.9.1  Session-Termination-Ind
                  11.9.2  Session-Termination-Request
                  11.9.3  Session-Termination-Answer
      12.0  Message Routing
            12.1  Realm-Based Message Routing
                  12.1.1  Realm-Based Routing Table
            12.2  Proxy and Redirect Server handling of requests
                  12.2.1  Proxy and Redirect Server handling of requests
            12.3  Redirect Server
                  12.3.1  Redirect-Host AVP
                  12.3.2  Redirect-Host-Address AVP
                  12.3.3  Redirect-Host-Port AVP



Calhoun et al.            expires October 2001                  [Page 4]





Internet-Draft                                                  May 2001


            12.4  Proxy Server
                  12.4.1  Proxying Request, Query and Indication messages
                  12.4.2  Proxying Response and Answer messages
                  12.4.3  Route-Record AVP
                  12.4.4  Proxy-Info AVP
                  12.4.5  Proxy-Address AVP
                  12.4.6  Proxy-State AVP
                  12.4.7  Destination-Realm AVP
            12.5  Applying Local Policies
            12.6  Hiding Network Topology
            12.7  Loop Detection
      13.0  Accounting
            13.1  Server Directed Model
            13.2  Protocol Messages
            13.3  Extension document requirements
            13.4  Fault Resilience
            13.5  Accounting Records
      14.0  Accounting Command-Codes
            14.1  Accounting-Request (ACR) Command
            14.2  Accounting-Answer (ACA) Command
            14.3  Accounting-Status-Ind (ASI) Command
            14.4  Accounting-Poll-Ind (API) Command
      15.0 Accounting AVPs
            15.1  Accounting-Record-Type AVP
            15.2  Accounting-Interim-Interval AVP
            15.3  Accounting-Record-Number AVP
            15.4  Accounting-State AVP
            15.5  Accounting-Session-Id AVP
      16.0  AVP Occurrence Table
            16.1  Base Protocol Command AVP Table
            16.2  Accounting AVP Table
      17.0  IANA Considerations
            17.1  AVP Header
                  17.1.1  AVP Code
                  17.1.2  AVP Flags
            17.2  Diameter Header
                  17.2.1  Command Codes
                  17.2.2  Message Flags
            17.3  Extension Identifier Values
            17.4  Result-Code AVP Values
            17.5  DSI-Event AVP Values
            17.6  Accounting-State AVP Values
            17.7  Accounting-Record-Type AVP Values
            17.8  Diameter TCP/SCTP Port Numbers
      18.0  Open Issues
      19.0  Diameter protocol related configurable parameters
      20.0  Security Considerations
      21.0  References



Calhoun et al.            expires October 2001                  [Page 5]





Internet-Draft                                                  May 2001


      22.0  Acknowledgements
      23.0  Authors' Addresses
      24.0  Full Copyright Statement
      Appendix A. Diameter Service Template















































Calhoun et al.            expires October 2001                  [Page 6]





Internet-Draft                                                  May 2001


1.0  Introduction

   Historically, the RADIUS protocol has been used to provide AAA
   services for dial-up PPP [42] and terminal server access. Over time,
   routers and network access servers (NAS) have increased in complexity
   and density, making the RADIUS protocol increasingly unsuitable for
   use in such networks.

   The Roaming Operations Working Group (ROAMOPS) has published a set of
   specifications [20, 43, 44] that define how a PPP user can gain
   access to the Internet without having to dial into his/her home
   service provider's modem pool. This is achieved by allowing service
   providers to cross-authenticate their users. Effectively, a user can
   dial into any service provider's point of presence (POP) that has a
   roaming agreement with his/her home Internet service provider (ISP),
   the benefit being that the user does not have to incur a long
   distance charge while traveling, which can sometimes be quite
   expensive.

   Given the number of ISPs today, ROAMOPS realized that requiring each
   ISP to set up roaming agreements with all other ISPs did not scale.
   Therefore, the working group defined a "broker", which acts as an
   intermediate server, whose sole purpose is to set up these roaming
   agreements. A collection of ISPs and a broker is called a "roaming
   consortium". There are many such brokers in existence today; many
   also provide settlement services for member ISPs.

   The Mobile-IP Working Group has recently changed its focus to inter
   administrative domain mobility, which is a requirement for cellular
   carriers wishing to deploy IETF-based mobility protocols. The current
   cellular carriers requirements [22, 23] are very similar to the
   ROAMOPS model, with the exception that the access protocol is
   Mobile-IP [45] instead of PPP.

   The Diameter protocol was not designed from the ground up. Instead,
   the basic RADIUS model was retained while fixing the flaws in the
   RADIUS protocol itself. Diameter does not share a common protocol
   data unit (PDU) with RADIUS, but does borrow sufficiently from the
   protocol to ease migration.

   The basic concept behind Diameter is to provide a base protocol that
   can be extended in order to provide AAA services to new access
   technologies. Currently, the protocol only concerns itself with
   Internet access, both in the traditional PPP sense as well as taking
   into account the ROAMOPS model, and Mobile-IP.

   Although Diameter could be used to solve a wider set of AAA problems,
   we are currently limiting the scope of the protocol in order to



Calhoun et al.            expires October 2001                  [Page 7]





Internet-Draft                                                  May 2001


   ensure that the effort remains focused on satisfying the requirements
   of network access. Note that a truly generic AAA protocol used by
   many applications might provide functionality not provided by
   Diameter. Therefore, it is imperative that the designers of new
   applications understand their requirements before using Diameter.


1.1  Diameter Protocol

   The Diameter protocol allows peers to exchange a variety of messages.
   The base protocol provides the following facilities:

      - Delivery of AVPs (attribute value pairs)
      - Capabilities negotiation, as required in [20]
      - Error notification
      - Extensibility, through addition of new commands and AVPs, as
        required in [21]

   All data delivered by the protocol is in the form of an AVP.  Some of
   these AVP values are used by the Diameter protocol itself, while
   others deliver data associated with particular applications which
   employ Diameter.  AVPs may be added arbitrarily to Diameter messages,
   so long as the required AVPs are included and AVPs which are
   explicitly excluded are not included.  AVPs are used by base Diameter
   protocol to support the following required features:

      - Transporting of user authentication information, for the
        purposes of enabling the Diameter server to authenticate the
        user.
      - Transporting of service specific authorization information,
        between client and servers, allowing the peers to decide whether
        a user's access request should be granted.
      - Exchanging resource usage information, which MAY be used for
        accounting purposes, capacity planning, etc.
      - Proxying and Re-directing of Diameter messages through a server
        hierarchy.

   The Diameter base protocol provides the minimum requirements needed
   for an AAA transport protocol, as required by NASREQ [21], Mobile IP
   [22, 23], and ROAMOPS [20]. The base protocol is not intended to be
   used by itself, and must be used with an application-specific
   extension, such as Mobile IP [10]. The Diameter protocol was heavily
   inspired and builds upon the tradition of the RADIUS [1] protocol.
   See section 2.4. for more information on Diameter extensions.

   Any node can initiate a request. In that sense, Diameter is a peer to
   peer protocol. In this document, a Diameter client is the device that
   normally initiates a request for authentication and/or authorization



Calhoun et al.            expires October 2001                  [Page 8]





Internet-Draft                                                  May 2001


   of a user. A Diameter server is the device that either forwards the
   request to another Diameter server (known as a proxy), or one that
   performs the actual authentication and/or authorization of the user
   based on some profile. Given that the server MAY send unsolicited
   messages to clients, it is possible for the server to initiate such
   messages. An example of an unsolicited message would be for a request
   that the client issue an accounting update.


1.2  Requirements language

   In this document, the key words "MAY", "MUST", "MUST NOT",
   "optional", "recommended", "SHOULD", and "SHOULD NOT", are to be
   interpreted as described in [13].


1.3  Terminology


   Accounting
      The act of collecting information on resource usage for the
      purpose of trend analysis, auditing, billing, or cost allocation.

   Authentication
      The act of verifying the identity of an entity (subject).

   Authorization
      The act of determining whether a requesting entity (subject) will
      be allowed access to a resource (object).

   AVP
      The Diameter protocol consists of a header followed by one or more
      Attribute-Value-Pair (AVP). The AVP includes a header and is used
      to encapsulation authentication, authorization or accounting
      information.

   Broker
      A broker is a business term commonly used in AAA infrastructures.
      A broker is either a proxy or redirect server, and MAY be operated
      by roaming consortiums.

   Diameter Client
      A Diameter Client is a device at the edge of the network that
      performs access control. An example of a Diameter client is a
      Network Access Server (NAS) or a Foreign Agent (FA).

   Diameter Server
      A Diameter server is a device that is not acting as a NAS or FA.



Calhoun et al.            expires October 2001                  [Page 9]





Internet-Draft                                                  May 2001


      Servers can be proxy, redirect, or home servers

   Downstream Server
      Diameter Proxy servers identify an upstream server as one that is
      providing routing services towards the Diameter client.

   Home Domain
      A Home Domain is the administrative domain with whom the user
      maintains an account relationship.

   Home Server
      A Diameter Home Server is one that authenticates and/or authorizes
      access for users of a particular realm. The same server MAY also
      act as a proxy or redirect server for other realms, in which case
      it is not acting as a Home Server for these realms.

   Interim accounting
      An interim accounting message provides a snapshot of usage during
      a user's session. It is typically implemented in order to provide
      for partial accounting of a user's session in the event of a
      device reboot or other network problem that prevents the reception
      of a session summary message or session record.

   Local Domain
      A local domain is the administrative domain providing services to
      a user. An administrative domain MAY act as a local domain for
      certain users, while being a home domain for others.

   Network Access Identifier
      The Network Access Identifier, or NAI [3], is used in the Diameter
      protocol to extract a user's identity and realm. The identity is
      used to identify the user during authentication and/or
      authorization, while the realm is used for message routing
      purposes.

   Proxy Server
      A proxy server ”ses the realm portion of the NAI to route Diameter
      messages. Proxy servers are typically used to minimize the number
      of security relationships that are required between Diameter
      servers.

   Realm
      The string in the NAI that immediately follows the '@' character.
      NAI realm names are required to be unique, and are piggybacked on
      the administration of the DNS namespace. Diameter makes use of the
      realm, also loosely referred to as domain, to determine whether
      messages can be satisfied locally, or whether they must be
      proxied.



Calhoun et al.            expires October 2001                 [Page 10]





Internet-Draft                                                  May 2001


   Real-time Accounting
      Real-time accounting involves the processing of information on
      resource usage within a defined time window. Time constraints are
      typically imposed in order to limit financial risk.

   Redirect Server
      A Diameter redirect server provides realm to address translation,
      by returning information necessary for Diameter peers to
      communicate directly. Redirect servers are different from proxies
      since they do not participate in the routing of messages between
      end Diameter nodes.

   Roaming Relationships
      Roaming relationships include relationships between companies and
      ISPs, relationships among peer ISPs within a roaming association,
      and relationships between an ISP and a roaming consortia.
      Together, the set of relationships forming a path between a local
      ISP's authentication proxy and the home authentication server is
      known as the roaming relationship path.

   Session
      The Diameter protocol is session based. When an authorization
      request is initially transmitted, it includes a session identifier
      that is used for the duration of the session. The Session-
      Identifier AVP contains the identifier and must be globally
      unique.

   Session record
      A session record represents a summary of the resource consumption
      of a user over the entire session. Accounting gateways creating
      the session record may do so by processing interim accounting
      events or accounting events from several devices serving the same
      user.

   Upstream Server
      Diameter Proxy servers identify a downstream server as one that is
      providing routing services towards the home server for a
      particular message.


2.0  Protocol Overview

   The base Diameter protocol is never used on its own.  It is always
   extended for a particular application.  Three extensions to Diameter
   are defined by companion documents:  NASREQ [7], Mobile IP [10],
   Strong Security [11].  These options are introduced in this document
   but specified elsewhere.  Additional extensions to Diameter may be
   defined in the future (see Section 17.3).



Calhoun et al.            expires October 2001                 [Page 11]





Internet-Draft                                                  May 2001


   Diameter servers MUST support the Base protocol, which includes
   Accounting, and both the NASREQ and Mobile IP extensions. Diameter
   Clients MUST support the Base protocol, including Accounting, and MAY
   support any other extension that would be required to provide
   service.

   The base Diameter protocol concerns itself with capabilities
   negotiation, and how messages are sent and how peers may eventually
   be abandoned.  The base protocol also defines certain rules which
   apply to all exchanges of messages between Diameter peers.

   Communication between Diameter peers begins with one peer sending a
   message to another Diameter peer. The set of AVPs included in the
   message is determined by a particular application of or extension to
   Diameter. We will refer to this as the Diameter extension. One AVP
   that is included to reference a user's session is the Session-Id.

   The initial request for authentication and/or authorization of a user
   would include the Session-Id. The Session-Id is then used in all
   subsequent messages to identify the user's session (see section 11.0
   for more information). The communicating party may accept the
   request, or reject it by returning a response with Result-Code AVP
   set to indicate an error occurred. The specific behavior of the
   diameter server or client receiving a request depends on the Diameter
   extension employed.

   Session state (associated with a Session-Id) MUST be freed upon
   receipt of the Session-Termination-Request, Session-Termination-
   Answer, expiration of authorized service time in the Session-Timeout
   AVP, and according to rules established in a particular
   extension/application of Diameter.

   Exchanges of messages are either request/reply oriented, or in some
   special cases, do not require replies.  All such messages that do not
   require replies have names ending with '-Ind' (short for Indication).

   The Diameter base protocol provides the Authorization-Lifetime AVP,
   which MAY be used by extensions to specify the duration of a specific
   authorized session.


2.1  Transport

   The base Diameter protocol is run on port TBD of both TCP [27] and
   SCTP [26] transport protocols (for interoperability test purposes
   port 1812 will be used until IANA assigns a port to the protocol).
   Diameter clients SHOULD support SCTP, but MUST support TCP if SCTP is
   not available. future versions of this specification may mandate that



Calhoun et al.            expires October 2001                 [Page 12]





Internet-Draft                                                  May 2001


   clients support SCTP. Diameter servers MUST support both TCP and
   SCTP.

   A Diameter node MAY send packets from any source port, but MUST be
   prepared to receive packets on port TBD. When a request is received,
   the source and destination ports in the reply are reversed. Note that
   the source and destination addresses used in request and replies MAY
   any of a peer's valid IP addresses.

   A given Diameter process SHOULD use the same port number to send all
   messages to aid in identifying which process sent a given message.
   More than one Diameter process MAY exist within a single host, so the
   sender's port number is needed to discriminate them.

   When no transport connection exists with a peer, an attempt to
   connect SHOULD be periodically attempted. The recommended connection
   interval is 30 seconds.


2.2  Securing Diameter Messages

   All Diameter messages MUST be secured between peers, and both SSL
   [38] and IP Security [37] are supported. Network Access Servers
   (NASes) and Foreign Agents, commonly referred to as clients, MUST
   support IP Security, while servers MUST support both SSL and IP
   Security. The communication between a client and server MUST use IP
   Security, while communication between servers MUST use SSL.

   All hosts running the Diameter protocol MUST have the necessary
   security policies to ensure that unauthenticated Diameter packets are
   not processed.


2.3  Diameter Protocol Extensibility

   There are various ways the Diameter protocol can be extended. This
   section is intended to assist protocol designers in selecting the
   best method of using the Diameter protocol.


2.3.1  Defining new AVP Values

   Defining a new AVP value is the best approach when a new application
   needs to make use of an existing Diameter extension, but requires
   that an existing AVP communicate different service-specific
   information (e.g.  NAS-Port-Type set to avian carriers).

   When an existing AVP can be used to communicate the new information,



Calhoun et al.            expires October 2001                 [Page 13]





Internet-Draft                                                  May 2001


   this approach is preferred over creating new AVPs.

   In order to allocate a new AVP value, a request MUST be sent to IANA,
   with a detailed explanation of the value. Furthermore, if the command
   code on which the AVP value is to be used would require a different
   set of mandatory AVPs be present, the list of AVPs must accompany the
   request.


2.3.2  Creating new AVPs

   New AVPs may be created when a new application requiring Diameter
   support can make use of an existing Diameter extension, but requires
   new AVPs to communicate service-specific information.

   Prior to defining the AVP, the AVP type MUST be one of the types
   listed in section 4.3. In the event that a logical grouping of AVPs
   is necessary, and multiple "groups" are possible in a given command,
   it is highly recommended that a Grouped AVP be used (see Section
   4.4).

   In order to create a new AVP, a request MUST be sent to IANA, with a
   detailed explanation of the AVP, its type and possible values.
   Furthermore, the request MUST include the commands that would make
   use of the AVP.

   Note that new AVPS to be used with an existing extension MUST NOT be
   defined to have the 'M'andatory bit set.


2.3.3  Creating new Diameter extensions

   Should a new application require Diameter support, but it cannot fit
   within an existing extension without requiring major changes to the
   specification, it may be desirable to create a new Diameter
   extension.  Major changes to an extension include:
      - Requiring a whole different set of mandatory AVPs to a command
      - Requiring a command that has a different number of round trips
        to satisfy a request (e.g. Extension foo has a command that
        requires one round trip, but new extension bar has a command
        that requires two round trips to complete).
      - The method used to authenticate the user is drastically
        different from any existing extension, and the authentication
        information cannot be carried within the AVPs defined in the
        extension.

   Note that the creation of a new extension should be viewed as a last
   resort.



Calhoun et al.            expires October 2001                 [Page 14]





Internet-Draft                                                  May 2001


   New Diameter extensions MUST define at least one Command Code, the
   expected AVPs in an ABNF [31] grammar (see section 3.2), and MAY also
   define new AVPs. If the Diameter extension has any accounting
   requirements, it MUST also specify the AVPs that are to be present in
   the Diameter Accounting messages (see section 13.3).

   When possible, a new Diameter extension SHOULD attempt to re-use any
   existing Diameter AVP, in order to reduce the possibility of having
   multiple AVPs that carry similar information.

   Every Diameter Extension specification MUST have an IANA assigned
   Extension Identifier (see section 2.4).


2.3.4  Extension authentication procedures

   When possible, extensions SHOULD be designed such that new
   authentication methods MAY be added without requiring changes to the
   extension. This MAY require that new AVP values be assigned to
   represent the new authentication transform, or any other scheme that
   produces similar results. When possible, authentication frameworks,
   such as Extensible Authentication Protocol [25], SHOULD be used.


2.4  Diameter Extension Compliance

   Extension Identifiers are advertised during the capabilities exchange
   phase (see section 6.0). For a given extension, there are two
   different ways of advertising support. First, advertising support of
   the extension via the Auth-Extension-Id implies that the sender
   supports all authentication and authorization command codes, and the
   AVPs specified in the associated ABNFs, described in the
   specification. Second, advertising support of the extension via the
   Acct-Extension-Id implies that the sender supports the Accounting
   command codes defined in this specification, as well as the
   accounting AVPs defined in the extension's specification.

   An implementation MAY add arbitrary AVPs to any command defined in an
   extension, including vendor-specific AVPs. However, such AVPs MUST
   NOT have the Mandatory ('M') bit set. An implementation that adds
   AVPs not specified in a command's ABNF, and sets the AVP's Mandatory
   bit MUST NOT advertise support of the extension.

   An implementation MAY support both a proprietary version of an
   extension by requesting an IANA extension identifier (see section
   17.3), while supporting the original extension. During the
   capabilities exchange, a Diameter node can determine whether to
   exchange messages using the proprietary or standard version of the



Calhoun et al.            expires October 2001                 [Page 15]





Internet-Draft                                                  May 2001


   extension by inspecting the extensions advertised by the peer.


2.5  Diameter Server Discovery

   Allowing for dynamic Diameter server discovery will make it possible
   for simpler and more robust deployment of AAA services.  In order to
   promote interoperable implementations of Diameter server discovery,
   the following mechanisms are described.  These are based on existing
   IETF standards.

   There are two cases where Diameter server discovery may be performed.
   The first is when a Diameter client needs to discover a first-hop
   Diameter server.  The second case is when a Diameter server needs to
   discover another server - for further handling of a Diameter
   operation. In both cases, the following 'search order' is
   recommended:

      1. The Diameter implementation consults its list of static
         (manual) configured Diameter server locations.  These will be
         used if they exist and respond.

      2. The Diameter implementation uses SLPv2 [28] to discover
         Diameter services.  The Diameter service template [32] is
         included in Appendix A. It is recommended that SLPv2 security
         be deployed (this requires distributing keys to SLPv2 agents.)
         This is discussed further in Appendix A.

         SLPv2 will allow Diameter implementations to discover the
         location of Diameter servers in the local site, as well as
         their characteristics.  Diameter servers with specific
         capabilities (say support for the Accounting extension) can be
         requested, and only those will be discovered.

      3. The Diameter implementation uses DNS to request the SRV RR [33]
         for the '_diameter._sctp' and/or '_diameter._tcp' server in a
         particular domain.  The Diameter implementation has to know in
         advance which domain to look for an Diameter server in.  This
         could be deduced, for example, from the 'realm' in a NAI that
         an Diameter implementation needed to perform an Diameter
         operation on.

         Diameter allows AAA peers to protect the integrity and privacy
         of communication as well as to perform end-point
         authentication.  Still, it is prudent to employ DNS Security as
         a precaution when using DNS SRV RRs to look up the location of
         a Diameter server.  [34, 35, 36]




Calhoun et al.            expires October 2001                 [Page 16]





Internet-Draft                                                  May 2001


3.0  Diameter Header

   A summary of the Diameter header format is shown below. The fields
   are transmitted in network byte order.

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |r r r r r r r r r r E I R| Ver |         Message Length        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      Hop-by-Hop Identifier                    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      End-to-End Identifier                    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                         Command-Code                          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                           Vendor-ID                           |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |  AVPs ...
      +-+-+-+-+-+-+-+-+-+-+-+-+-

   Flags
      The Message Flags field is thirteen bits.  The following bits are
      assigned:

         r(eserved) MUST be zero - this flag bit is reserved for
                    future use.
         E(xpected Reply) - The message solicits a response.
         I(nterrogation) - The message is a Query or a Response.
         R(esponse) - The message is a response to another message.

      These flags MUST be set depending on the command code used in a
      Diameter message.  This enables the type of message to be
      interpreted, even if the specific command code is not recognized.

      Command Type   Flags Set
      Indication      - - -
      Request         E - -
      Answer          - - R
      Query           E I -
      Response        - I R

      A Diameter node MUST NOT set these flags in any other combination.
      A Diameter node receiving a message in which these flags are not
      set appropriately MAY reject the message for this reason, but
      SHOULD log the event for diagnosis.





Calhoun et al.            expires October 2001                 [Page 17]





Internet-Draft                                                  May 2001


   Version
      This Version field MUST be set to 1 to indicate Diameter Version
      1.

   Message Length
      The Message Length field is two octets and indicates the length of
      the Diameter message including the header fields.

   Hop-by-Hop Identifier
      The Hop-by-Hop Identifier field is four octets, and aids in
      matching requests and replies. The sender MUST ensure that the
      Hop-by-Hop identifier in a request (*-Request or *-Query) or
      indication (*-Ind) message is locally unique (to the sender) at
      any given time, and MAY attempt to ensure that the number is
      unique across reboots. The sender of a response (*-Answer or *-
      Response) MUST ensure that the Hop-by-Hop Identifier field
      contains the same value that was found in the corresponding
      request.  The Hop-by-Hop identifier is normally a monotonically
      increasing number, whose start value was randomly generated. A
      message of type Answer or Response that is received with an
      unknown Hop-by-Hop Identifier MUST be discarded.

   End-to-End Identifier
      Unlike the Hop-by-Hop Identifier, the End-to-End Identifier is
      used by servers to detect duplicate messages, and proxies MUST NOT
      modify this field. The sender of a request, query, indication,
      answer or response message MUST insert a locally unique value in
      this field.  The combination of the Session-Id AVP and this field
      is used to detect duplicates. A message of type Answer or Response
      which is received with a previously seen End-to-End Identifier,
      and is to be locally consumed (meaning that the Destination-FQDN
      AVP contains the local node's identity) SHOULD be silently
      discarded.

   Command-Code
      The Command-Code field is four octets, and is used in order to
      communicate the command associated with the message. The 32-bit
      address space is managed by IANA (see section 17.2).

   Vendor-ID
      In the event that the Command-Code field contains a vendor
      specific command, the four octet Vendor-ID field contains the IANA
      assigned "SMI Network Management Private Enterprise Codes" [2]
      value. If the Command-Code field contains an IETF standard
      Command, the Vendor-ID field MUST be set to zero (0).

   AVPs
      AVPs are a method of encapsulating information relevant to the



Calhoun et al.            expires October 2001                 [Page 18]





Internet-Draft                                                  May 2001


      Diameter message. See section 4. for more information on AVPs.


3.1  Command Codes

   Every Diameter message MUST contain a value in its header's Command-
   Code field, which is used to determine the action that is to be taken
   for a particular message. The following Command Codes are defined in
   the Diameter base protocol:

         Command-Name             Abbrev.    Code       Reference
         --------------------------------------------------------
         Accounting-Answer         ACA       272           14.2
         Accounting-Poll-Ind       API       273           14.4
         Accounting-Request        ACR       271           14.1
         Accounting-Status-Ind     ASI       279           14.3
         Device-Reboot-Ind         DRI       257           6.2
         Device-Status-Ind         DSI       282           9.1
         Device-Watchdog-Req       DWR       280           7.1
         Device-Watchdog-Answer    DWA       281           7.2
         Message-Reject-Ind        MRI       259           10.1
         Session-Termination-Ind   STI       274           11.9.1
         Session-Termination-      STR       275           11.9.2
            Request
         Session-Termination-      STA       276           11.9.3
            Answer


3.2  Command Code ABNF specification

   Every Command Code defined MUST include a corresponding ABNF
   specification, which is used to define the AVPs that MUST, MAY and
   MUST NOT be present.  The following format is used in the definition:

      command-def      = command-name "::=" diameter-message

      diameter-name    = ALPHA *(ALPHA / DIGIT / "-")

      command-name     = diameter-name
                          ; The command-name has to be Command name,
                          ; defined in the base or extended Diameter
                          ; specifications.

      diameter-message = header  [ *fixed] [ *required] [ *optional] [ *fixed]

      header           = "<Diameter-Header:" command-id ">"

      fixed            = [qual] "<" avp-spec ">"



Calhoun et al.            expires October 2001                 [Page 19]





Internet-Draft                                                  May 2001


      required         = [qual] "{" avp-spec "}"

      optional         = [qual] "[" avp-name "]"
                          ; The avp-name in the 'optional' rule cannot
                          ; evaluate to any AVP Name which is included
                          ; in a fixed or required rule.

      qual             = [min] "*" [max]
                          ; See ABNF conventions, RFC 2234 section 6.6.
                          ; The absence of any qualifiers implies that one
                          ; and only one such AVP MUST be present.
                          ;
                          ; NOTE:  "[" and "]" have a different meaning
                          ; than in ABNF (see the optional rule, above).
                          ; These braces cannot be used to express
                          ; optional fixed rules (such as an optional
                          ; ICV at the end.)  To do this, the convention
                          ; is '0*1fixed'.

      min              = 1*DIGIT
                          ; The minimum number of times the element may
                          ; be present.

      max              = 1*DIGIT
                          ; The maximum number of times the element may
                          ; be present.

      avp-spec         = diameter-name
                          ; The avp-spec has to be an AVP Name, defined
                          ; in the base or extended Diameter
                          ; specifications.

      avp-name         = avp-spec | "AVP"
                          ; The string "AVP" stands for *any* arbitrary
                          ; AVP Name, which does not conflict with the
                          ; required or fixed position AVPs defined in
                          ; the command code definition.

   The following is a definition of a fictitious command code:

      Example-Command ::= < Diameter-Header: 9999999 >
                          { User-Name }
                        * { Origin-FQDN }
                        * [ AVP ]


3.3  Diameter Command Naming Conventions




Calhoun et al.            expires October 2001                 [Page 20]





Internet-Draft                                                  May 2001


   The following conventions are required for the naming of Diameter
   messages. Diameter commands typically start with an object name, and
   end with one of the following verbs:


3.3.1  Request/Answer

   Request is used when the command is asking the peer to do something
   for it, for example, authorize a user, or terminate a session.  The
   Answer MUST contain either a positive or negative result code,
   telling the requester whether or not the request successfully
   occurred. Other information can also be returned in the Answer.

   For example, AA-Request asks the peer device to authorize and/or
   authenticate a user in order to set up a session. The request may
   fail, thus the answer may be positive or negative.


3.3.2  Query/Response

   Query is used when the command is asking for information that it
   expects the peer to have. An example would be querying for current
   configuration information, or querying for information on resources
   or sessions in use. The Response usually contains a positive result
   code and the information, or a negative result code with the reason
   for not completing the query.

   For example, Resource-Query requests the peer device to return
   specific information about one or more resources. The answer is
   returned in a Resource-Response.


3.3.3  Indication

   Indication is used either when the node wishes to inform the peer
   that an event occurred, or is requesting that a particular function
   be performed, but is not expecting a response. The transport level
   acknowledgement is used to ensure that the message was reliably
   delivered.


4.0  Diameter AVPs

   Diameter AVPs carry specific authentication, accounting and
   authorization information, security information as well as
   configuration details for the request and reply.

   Some AVPs MAY be listed more than once. The effect of such an AVP is



Calhoun et al.            expires October 2001                 [Page 21]





Internet-Draft                                                  May 2001


   specific, and is specified in each case by the AVP description.

   Each AVP of type OctetString MUST be padded to align on a 32 bit
   boundary, while other AVP types align naturally. NULL bytes are added
   to the end of the AVP Data field till a word boundary is reached. The
   length of the padding is not reflected in the AVP Length field.


4.1  AVP Header

   The fields in the AVP header MUST be sent in network byte order.  The
   format of the header is:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                           AVP Code                            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |          AVP Length           |     Reserved        |P|r|V|r|M|
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Vendor-ID (opt)                        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |    Data ...
      +-+-+-+-+-+-+-+-+

   AVP Code
      The AVP Code identifies the attribute uniquely. The first 256 AVP
      numbers are reserved for backward compatibility with RADIUS and
      are to be interpreted as per NASREQ [7]. AVP numbers 256 and above
      are used for Diameter, which are allocated by IANA (see section
      17.1).

   AVP Length
      The AVP Length field is two octets, and indicates the length of
      this AVP including the AVP Code, AVP Length, AVP Flags, Reserved,
      the Vendor-ID field (if present) and the AVP data. If a message is
      received with an invalid attribute length, the message SHOULD be
      rejected.

   AVP Flags
      The AVP Flags field informs the Diameter host how each attribute
      must be handled. Note that subsequent Diameter extensions MAY
      define bits to be used within the AVP Header, and an unrecognized
      bit should be considered an error. The 'r' and the reserved bits
      are unused and should be set to 0 and ignored on receipt, while
      the 'P' bit is defined in [11].

      The 'M' Bit, known as the Mandatory bit, indicates whether support



Calhoun et al.            expires October 2001                 [Page 22]





Internet-Draft                                                  May 2001


      of the AVP is required. If an AVP is received by a Home server or
      NAS with the 'M'  bit enabled and the receiver does not support
      the AVP, the message MUST  be rejected. If such an AVP is received
      by a Proxy or Redirect Server, the message MUST be forwarded to
      its logical destination, and MUST NOT be rejected. It is the
      responsibility of the originator of a message that is rejected for
      this purpose to correct the error.  AVPs without the 'M' bit
      enabled are informational only and a receiver that receives a
      message with such an AVP that is not supported MAY simply ignore
      the AVP.

      The 'V' bit, known as the Vendor-Specific bit, indicates whether
      the optional Vendor-ID field is present in the AVP header. When
      set the AVP Code belongs to the specific vendor code address
      space.

      Unless otherwise noted, AVPs will have the following default AVP
      Flags field settings:
         The 'M' bit MUST be set. The 'V' bit MUST NOT be set.


4.2  Optional Header Elements

   The AVP Header contains one optional field. This field is only
   present if the respective bit-flag is enabled.

   Vendor-ID
      The Vendor-ID field is present if the 'V' bit is set in the AVP
      Flags field. The optional four octet Vendor-ID field contains the
      IANA assigned "SMI Network Management Private Enterprise Codes"
      [2] value, encoded in network byte order. Any vendor wishing to
      implement a Diameter extension MUST use their own Vendor-ID along
      with their privately managed AVP address space, guaranteeing that
      they will not collide with any other vendor's extensions, nor with
      future IETF extensions.

      A vendor ID value of zero (0) corresponds to the IETF adopted AVP
      values, as managed by the IANA. Since the absence of the vendor ID
      field implies that the AVP in question is not vendor specific,
      implementations SHOULD not use the zero (0) vendor ID.


4.3  AVP Data Formats

   The Data field is zero or more octets and contains information
   specific to the Attribute. The format and length of the Data field is
   determined by the AVP Code and AVP Length fields. The format of the
   Data field MAY be one of the following data types.



Calhoun et al.            expires October 2001                 [Page 23]





Internet-Draft                                                  May 2001


   The interpretation of the values depends on the specification of the
   AVP.  For example, an OctetString may be used to transmit human
   readable string data and Unsigned32 may be used to transmit a time
   value.  Conventions for these common interpretations are described
   below.

      OctetString
         The data contains arbitrary data of variable length. Unless
         otherwise noted, the AVP Length field MUST be set to at least 9
         (13 if the 'V' bit is enabled).  Data used to transmit (human
         readable) character string data uses the UTF-8 [24] character
         set and is NOT NULL-terminated. The minimum Length field MUST
         be 9, but can be set to any value up to 65504 bytes. AVP Values
         of this type that do not align on a 32-bit boundary MUST have
         the necessary padding.

      Address
         32 bit (IPv4) [17] or 128 bit (IPv6) [16] address, most
         significant octet first. The format of the address (IPv4 or
         IPv6) is determined by the length. If the attribute value is an
         IPv4 address, the AVP Length field MUST be 12 (16 if 'V' bit is
         enabled), otherwise the AVP Length field MUST be set to 24 (28
         if the 'V' bit is enabled) for IPv6 addresses.

      Integer32
         32 bit signed value, in network byte order. The AVP Length
         field MUST be set to 12 (16 if the 'V' bit is enabled).

      Integer64
         64 bit signed value, in network byte order. The AVP Length
         field MUST be set to 16 (20 if the 'V' bit is enabled).

      Unsigned32
         32 bit unsigned value, in network byte order. The AVP Length
         field MUST be set to 12 (16 if the 'V' bit is enabled).
         Unsigned32 values used to transmit time data contains the four
         most significant octets returned from NTP [18], in network byte
         order.

      Unsigned64
         32 bit unsigned value, in network byte order. The AVP Length
         field MUST be set to 16 (20 if the 'V' bit is enabled).

      Float32
         This represents floating point values of single precision as
         described by [30].  The 32 bit value is transmitted in network
         byte order. The AVP Length field MUST be set to 12 (16 if the
         'V' bit is enabled).



Calhoun et al.            expires October 2001                 [Page 24]





Internet-Draft                                                  May 2001


      Float64
         This represents floating point values of double precision as
         described by [30].  The 64 bit value is transmitted in network
         byte order. The AVP Length field MUST be set to 16 (20 if the
         'V' bit is enabled).

      Float128
         This represents floating point values of quadruple precision as
         described by [30].  The 128 bit value is transmitted in network
         byte order. The AVP Length field MUST be set to 24 (28 if the
         'V' bit is enabled).

      Grouped
         The Data field is specified as a sequence of AVPs.  Each of
         these AVPs follows - in the order in which they are specified -
         including their headers and padding.  The AVP Length field is
         set to 8 (12 if the 'V' bit is enabled) plus the total length
         of all included AVPs, including their headers and padding.


4.4  Grouped AVP Values

   The Diameter protocol allows AVP values of type 'Grouped.'  This
   implies that the Data field is actually a well defined sequence of
   AVPs.  It is possible to include an AVP with a Grouped type within a
   Grouped type, that is, to nest them. AVPs within an AVP of type
   Grouped have the same padding requirements as non-Grouped AVPs, as
   defined in section 4.0.

   Grouped type AVP specifications include an ABNF grammar [31]
   specifying the required sequence of AVPs.  Grouped AVP values MUST be
   in the specified sequence and MUST NOT include other AVP values
   besides those specified by the Grouped AVP grammar.


4.4.1  Example AVP with a Grouped Data type

   The Example AVP (AVP Code 999999) is of type Grouped and is used to
   clarify how Grouped AVP values work.  The Grouped Data field has the
   following ABNF grammar:

      example-avp-val = Origin-FQDN Host-IP-Address
         Origin-FQDN     = ; See Section 5.1
         Host-IP-Address = ; See Section 6.2.4

   An Example AVP with the Grouped Data Origin-FQDN = "example.com",
   Host-IP-Address = "10.10.10.10" would be encoded as follows:




Calhoun et al.            expires October 2001                 [Page 25]





Internet-Draft                                                  May 2001


          0       1       2       3       4       5       6       7
      +-------+-------+-------+-------+-------+-------+-------+-------+
    0 |     Example AVP Header (AVP Code = 999999), Length = 40       |
      +-------+-------+-------+-------+-------+-------+-------+-------+
    8 |     Origin-FQDN AVP Header (AVP Code = 264), Length = 19      |
      +-------+-------+-------+-------+-------+-------+-------+-------+
   16 |  'e'  |  'x'  |  'a'  |  'm'  |  'p'  |  'l'  |  'e'  |  '.'  |
      +-------+-------+-------+-------+-------+-------+-------+-------+
   24 |  'c'  |  'o'  |  'm'  |Padding|    Host-IP-Addr AVP Header    |
      +-------+-------+-------+-------+-------+-------+-------+-------+
   32 | (AVP Code = 257), Length = 12 |  0x0a |  0x0a |  0x0a | 0x0a  |
      +-------+-------+-------+-------+-------+-------+-------+-------+


4.5  Diameter Base Protocol AVPs

   The following table describes the Diameter AVPs defined in the base
   protocol, their AVP Code values, types, possible flag values and
   whether the AVP MAY be encrypted.

                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|MAY |
   Attribute Name  Code Defined  Data Type  |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   Accounting-      482  15.2    Unsigned32 | M  |  P  |    |  V  | Y  |
     Interim-Interval                       |    |     |    |     |    |
   Accounting-      485  15.3    Unsigned32 | M  |  P  |    |  V  | Y  |
     Record-Number                          |    |     |    |     |    |
   Accounting-      480  15.1    Unsigned32 | M  |  P  |    |  V  | Y  |
     Record-Type                            |    |     |    |     |    |
   Accounting-       44  15.5    OctetString| M  |  P  |    |  V  | Y  |
     Session-Id                             |    |     |    |     |    |
   Accounting-State 486  15.4    Unsigned32 | M  |  P  |    |  V  | Y  |
   Acct-Extension-  259  6.2.x   Integer32  | M  |     |    |     | Y  |
     Id                                     |    |     |    |     |    |
   Auth-Extension-  258  6.2.3   Integer32  | M  |     |    |     | Y  |
     Id                                     |    |     |    |     |    |
   Authorization-   291  11.4    Unsigned32 |    |     |    |     | N  |
     Lifetime                               |    |     |    |     |    |
   Destination-FQDN 293  5.3     OctetString|    |     |    |     | Y  |
   Destination-     283  12.4.7  OctetString| M  |     |    |  V  | N  |
     Realm                                  |    |     |    |     |    |
   DSI-Event        297  9.1.1   Unsigned32 | M  |     |    |     | N  |
   Error-Message    281  10.3    OctetString|    |     |    |     | N  |
   -----------------------------------------|----+-----+----+-----|----|




Calhoun et al.            expires October 2001                 [Page 26]





Internet-Draft                                                  May 2001


                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|MAY |
   Attribute Name  Code Defined  Data Type  |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   Error-Reporting- 294  10.4    OctetString|    |     |    |     | Y  |
     FQDN                                   |    |     |    |     |    |
   Failed-AVP       279  10.1.1  OctetString|    |     |    |     | Y  |
   Failed-Command-  270  10.1.2  Unsigned32 |    |     |    |     | Y  |
     Code                                   |    |     |    |     |    |
   Failed-Vendor-Id 262  10.1.5  Unsigned32 |    |     |    |     | Y  |
   Firmware-        267  6.2.2   Unsigned32 |    |     |    | V,M | Y  |
     Revision                               |    |     |    |     |    |
   Host-IP-Address  257  6.2.4   Address    | M  |     |    |  V  | N  |
   Max-Wait-Time    295  11.7    Unsigned32 | M  |     |    |  V  | N  |
   Offending-AVP    271  10.1.4  OctetString| M  |     |    |  V  | N  |
   Offending-       272  10.1.3  Unsigned32 | M  |     |    |  V  | N  |
     Command-Code                           |    |     |    |     |    |
   Origin-FQDN      264  5.1     OctetString| M  |     |    |  V  | N  |
   Origin-Realm     296  5.2     OctetString| M  |     |    |  V  | N  |
   Original-        261  11.8.1  OctetString| M  |     |    |  V  | N  |
      Session-Id                            |    |     |    |     |    |
   Product-Name     269  6.2.6   OctetString|    |     |    |     | N  |
   Proxy-Address    280  12.4.5  Address    | M  |     |    |  V  | N  |
   Proxy-Info       284  12.4.4  OctetString| M  |     |    |  V  | N  |
   Proxy-State       33  12.4.6  Grouped    | M  |     |    |  V  | N  |
   Redirect-Host    292  12.3.1  Grouped    |    |     |    |     | Y  |
   Redirect-Host-   278  12.3.2  Address    |    |     |    |     | Y  |
     Address                                |    |     |    |     |    |
   Redirect-Host-   277  12.3.3  Unsigned32 |    |     |    |     | Y  |
     Port                                   |    |     |    |     |    |
   Result-Code      268  10.2    Unsigned32 | M  |     |    |     | N  |
   Route-Record     282  12.4.3  OctetString| M  |     |    |  V  | N  |
   Session-Id       263  11.3    OctetString| M  |     |    |     | Y  |
   Session-Timeout   27  11.5    Unsigned32 |    |     |    |     | Y  |
   Supported-       265  6.2.5   Unsigned32 |    |     |    |     | N  |
     Vendor-Id                              |    |     |    |     |    |
   User-Name          1  11.6    OctetString|    |     |    |     | Y  |
   Vendor-Id        266  6.2.1   Unsigned32 |    |     |    | V,M | Y  |
   -----------------------------------------|----+-----+----+-----|----|


5.0  Message Forwarding

   All Diameter messages MUST include the Origin-FQDN and Origin-Realm
   AVPs. These AVPs are used to identify the source of the message.
   When responding to a request or query message, the Origin-FQDN and



Calhoun et al.            expires October 2001                 [Page 27]





Internet-Draft                                                  May 2001


   Origin-Realm AVPs are replaced with the local node's information.

   The Destination-FQDN AVP is used when the destination of the message
   is fixed, such as:

      - Authentication requests that span multiple round trips
      - A Diameter message that uses a security mechanism that makes use
        of a pre-established session key shared between the source and
        the final destination of the message.
      - Server initiated messages that MUST be received by a specific
        Diameter client (e.g. access device), such as the Session-
        Termination-Ind message, which is used to request that a
        particular user's session be terminated.

   Proxies receiving messages that contain the Destination-FQDN AVP MUST
   verify whether they are able to forward Diameter messages to the host
   specified in the AVP, and if so, MUST forward the message to the host
   in question. Otherwise, the message routing procedures described in
   section 12.0 MUST be followed.

   Unless otherwise specified, this section defines the Diameter AVPs
   that MUST be added in all messages originated by a Diameter node
   (including nodes creating Response and Answer messages).


5.1 Origin-FQDN AVP

   The Origin-FQDN AVP (AVP Code 264) is of type OctetString, encoded in
   the UTF-8 [24] format. This AVP identifies the endpoint which
   originated the Diameter message, i.e. the access device, home server,
   or broker. Proxy servers do not modify this AVP. All Diameter
   messages MUST include the Origin-FQDN AVP, which contains the host
   name of the originator of the Diameter message and MUST follow the
   Fully Qualified Domain Name naming conventions.

   Note that the Origin-FQDN AVP may resolve to more than one address as
   the Diameter peer may support more than one address.


5.2 Origin-Realm AVP

   The Origin-Realm AVP (AVP Code 296) is of type OctetString, encoded
   in the UTF-8 [24] format. This AVP contains the Realm of the
   originator of any Diameter message.


5.3  Destination-FQDN AVP




Calhoun et al.            expires October 2001                 [Page 28]





Internet-Draft                                                  May 2001


   The Destination-FQDN AVP (AVP Code 293) is of type OctetString,
   encoded in the UTF-8 [24] format, and contains the Fully Qualified
   Domain Name (FQDN) of the intended recipient of the message. This AVP
   MUST be present in all unsolicited server initiated messages, MAY be
   present in messages of type Indication, Request or Query, and MUST be
   present in messages of type Answer or Response. The value of the
   Destination-FQDN AVP is set to the value of the Origin-FQDN AVP found
   in a message from the intended target host.


6.0  Capabilities Exchange

   When two Diameter peers establish a transport connection, they MUST
   send the Device-Reboot-Ind message. This message has two purposes.
   First it allows a peer's identity to be discovered, and allows for
   capabilities exchange, such as the supported protocol version number,
   and the locally supported extensions.

   The receiver uses the extensions advertised in order to determine
   whether it SHOULD send certain application-specific Diameter
   commands. A Diameter node MUST retain the supported extensions in
   order to ensure that unrecognized commands and/or AVPs are not sent
   to a peer.

   A receiver of a Device-Reboot-Ind message which does not have any
   extensions in common with the sender MUST return a DSI message to the
   peer with the DSI-Event AVP set to DIAMETER_NO_COMMON_EXTENSION, and
   disconnect the transport layer connection.

   The Device-Reboot-Ind message MUST NOT be proxied, or redirected.

   Since the DRI cannot be proxied, it is still possible that a upstream
   proxy receives a message for which it has no available peers to
   handle the extension that corresponds to the Command-Code. In such
   instances, the Device-Status-Ind message is used (see Section 9.1) to
   inform the downstream to take action.

   With the exception of the Device-Reboot-Ind message, a message of
   type Request, Query or Indication that includes the Auth-Extension-Id
   or Acct-Extension-Id AVPs, or a message with an extension-specific
   command code, MAY only be forwarded to a host that has explicitly
   advertised support for the extension (or has advertised the Wildcard
   Extension).


6.1  Extension Identifiers

   Each Diameter extension draft MUST have an IANA assigned Extension



Calhoun et al.            expires October 2001                 [Page 29]





Internet-Draft                                                  May 2001


   Identifier (see section 17.3). The base protocol does not require an
   Extension Identifier since its support is mandatory.

   Extension Identifiers are communicated via two separate AVPs; Auth-
   Extension-Id and Acct-Extension-Id. The Auth-Extension-Id AVP is used
   to communicate support for the authentication and authorization
   portion of an extension. The Acct-Extension-Id AVP, on the other
   hand, communicates support for the accounting portion of an
   extension.

   This separation of AVPs allows a server to communicate that it is
   willing to accept only accounting messages for a given extension.

   The following Extension Identifier values are defined:

      NASREQ               1 [7]
      End-to-End Security  2 [11]
      Resource Management  3 [29]
      Mobile-IP            4 [10]
      Wildcard Extension   0xffffffff

   Servers acting as Redirect or Proxy servers (see Section 12.0) MAY
   wish to either advertise all supported extensions, or the wildcard
   extension. The receiver of a wildcard extension MUST assume that the
   sender supports all extensions.

   Proxy servers are responsible for finding a downstream server that
   supports the extension of a particular message. If none can be found,
   a DSI message is returned with the DSI-Event AVP set to
   DIAMETER_UNABLE_TO_DELIVER.


6.2  Device-Reboot-Ind (DRI) Command

   The Device-Reboot-Ind (DRI), indicated by the Command-Code set to
   257, is sent to inform a peer that a reboot has, or will, occur.

   When Diameter is run over SCTP [26], which allows for connections to
   span multiple interfaces, hence multiple IP addresses, the Device-
   Reboot-Ind message MUST contain one Host-IP-Address AVP for each
   potential IP address that MAY be locally used when transmitting
   Diameter messages.

   If a Diameter node receives a DRI message that results in an error, a
   Message-Reject-Ind message MUST be returned.

   Message Format




Calhoun et al.            expires October 2001                 [Page 30]





Internet-Draft                                                  May 2001


      <Device-Reboot-Ind> ::= < Diameter Header: 257 >
                              { Origin-FQDN }
                              { Origin-Realm }
                           1* { Host-IP-Address }
                              { Vendor-Id }
                              { Product-Name }
                            * { Supported-Vendor-Id }
                            * [ Auth-Extension-Id ]
                            * [ Acct-Extension-Id ]
                              [ Destination-FQDN ]
                              [ Firmware-Revision ]
                            * [ AVP ]


6.2.1  Vendor-Id AVP

   The Vendor-Id AVP (AVP Code 266) is of type Unsigned32 and contains
   the IANA "SMI Network Management Private Enterprise Codes" [2] value
   assigned to the vendor of the Diameter device.

   In combination with the Supported-Vendor-Id AVP (section 6.2.5), this
   MAY be used in order to know which vendor specific attributes may be
   sent to the peer. It is also envisioned that the combination of the
   Vendor-Id, Product-Name (section 6.2.6) and the Firmware-Revision
   (section 6.2.2) AVPs MAY provide very useful debugging information.

   A Vendor-Id value of zero in the DRI is reserved and indicates that
   the Diameter peer is in the experimental or concept stage and that an
   IANA Private Enterprise Number has yet to be obtained by the
   implementor.


6.2.2  Firmware-Revision AVP

   The Firmware-Revision AVP (AVP Code 267) is of type Unsigned32 and is
   used to inform a Diameter peer of the firmware revision of the
   issuing device.

   For devices that do not have a firmware revision (general purpose
   computers running Diameter software modules, for instance), the
   revision of the Diameter software module may be reported instead.


6.2.3  Auth-Extension-Id AVP

   The Auth-Extension-Id AVP (AVP Code 258) is of type Unsigned32 and is
   used in order to advertise support of the Authentication and
   Authorization portion of an extension (see Section 6.1). The Auth-



Calhoun et al.            expires October 2001                 [Page 31]





Internet-Draft                                                  May 2001


   Extension-Id MUST also be present in all Authentication and/or
   Authorization messages that are defined in a separate Diameter
   specification and have an Extension ID assigned.


6.2.4  Host-IP-Address AVP

   The Host-IP-Address AVP (AVP Code 257) is of type Address and is used
   to inform a Diameter peer of the sender's IP address.  All source
   addresses that a Diameter node expects to use with SCTP [26] MUST be
   advertised in the Device-Reboot-Ind message by including a Host-IP-
   Address AVP for each address. This AVP MUST ONLY be used in the
   Device-Reboot-Ind message.


6.2.5  Supported-Vendor-Id AVP

   The Supported-Vendor-Id AVP (AVP Code 265) is of type Unsigned32 and
   contains the IANA "SMI Network Management Private Enterprise Codes"
   [2] value assigned to a vendor other than the device vendor. This is
   used in the Device-Reboot-Ind message in order to inform the peer
   that the sender supports a subset of the vendor-specific commands
   and/or attributes defined by the vendor identified in this AVP.


6.2.6  Product-Name AVP

   The Product-Name AVP (AVP Code 269) is of type OctetString, encoded
   in the UTF-8 [24] format, and contains the vendor assigned name for
   the product. The Product-Name AVP SHOULD remain constant across
   firmware revisions for the same product.


6.2.7  Acct-Extension-Id AVP

   The Acct-Extension-Id AVP (AVP Code 259) is of type Unsigned32 and is
   used in order to advertise support of the Accounting portion of an
   extension (see Section 6.1). The Acct-Extension-Id MUST also be
   present in all Accounting messages that are defined in a separate
   Diameter specification and have an Extension ID assigned.


7.0  Transport Failure Detection

   Given the nature of the Diameter protocol, it is recommended that
   transport failures be detected as soon as possible. Detecting such
   failures will minimize the occurrence of messages sent to unavailable
   servers, resulting in unnecessary delays, and will provide better



Calhoun et al.            expires October 2001                 [Page 32]





Internet-Draft                                                  May 2001


   failover performance.

   In order to pro-actively detect such failures, the Diameter protocol
   defines the Device-Watchdog-Request message, which is sent to an
   inactive peer. A peer is considered inactive if no messages were sent
   or received from the peer within the current watchdog interval period
   (see Section 19.0), and no request or query messages are pending with
   the peer.

   For implementations that have access to the Retransmission Time-Out
   (RTO) value of the underlying transport connection, a DWR SHOULD be
   sent once per RTO of that connection, plus the watchdog interval
   period, with a jittering of +/- 50%.

   If the DWR is unanswered, the time until the next DWR is sent MUST be
   recalculated after exponentially backing off the RTO portion.  When
   the value of the DWR's current watchdog interval period reaches the
   maximum watchdog interval (Section 19.0), backoff is not continued,
   and the peer is marked as failed.  DWR messages continue to be sent
   (jittered) at the final interval for detection for failover.  The
   current watchdog interval is returned to its starting point when a
   DWA is received or the peer resumes activity.

   Implementations that do not have access to the RTO SHOULD perform an
   Round Trip Time (RTT) measurement for a given peer when a Device-
   Watchdog-Answer message is received for a non-backed off DWR.  The
   fixed RTO base should be replaced by RTT-Multiplier (Section 19.0)
   times the measured RTT.

   An example of the backoff sequence, excluding jitter, would be:
      30+RTO , 30+2*RTO , 30+4*RTO , 30+8*RTO, 60, 60, 60

   Note that exponential backoff MUST be performed before the maximum is
   reached.


7.1  Device-Watchdog-Request

   The Device-Watchdog-Request (DWR), indicated by the Command-Code set
   to 280, is sent to a peer when no traffic has been exchanged between
   two peers as defined in Section 7.0, and no requests are pending with
   the peer.

   Message Format







Calhoun et al.            expires October 2001                 [Page 33]





Internet-Draft                                                  May 2001


      <Device-Watchdog-Request>  ::= < Diameter Header: 280 >
                                     { Origin-FQDN }
                                     { Origin-Realm }
                                     [ Destination-FQDN ]


7.2  Device-Watchdog-Answer

   The Device-Watchdog-Answer (DWA), indicated by the Command-Code set
   to 281, is sent as a response to the Device-Watchdog-Request message.
   A receiver of the DWA SHOULD perform RTT calculation in the event
   that the transport RTO information is not available.

   Message Format

      <Device-Watchdog-Answer>  ::= < Diameter Header: 281 >
                                    { Result-Code }
                                    { Origin-FQDN }
                                    { Origin-Realm }
                                    { Destination-FQDN }


7.3  Failover/Failback Procedures

   In the event that a transport failure is detected with a peer, it is
   necessary for all pending request, query and indication messages to
   be forwarded to an alternate server, if possible. This is commonly
   referred to as failover.

   In order for a Diameter node to perform failover procedures, it is
   necessary for the node to maintain a pending message queue for a
   given peer. When a response is received, the message is removed from
   the queue. The Hop-by-Hop Identifier field MAY be used to match the
   corresponding response with the queued request.

   When a transport failure is detected, all messages in the queue are
   sent to an alternate server, if possible. An example of a case where
   it is not possible for forward the message to an alternate server is
   when the message has a fixed destination, and the unavailable peer is
   the message's final destination (see Destination-FQDN AVP). Such an
   error requires that the server return an DSI with the DSI-Event AVP
   set to DIAMETER_UNABLE_TO_DELIVER.

   It is important to note that multiple identical request or responses
   MAY be received as a result of a failover. The End-to-End Identifier
   field in the Diameter header MUST be used to identify duplicate
   messages.




Calhoun et al.            expires October 2001                 [Page 34]





Internet-Draft                                                  May 2001


   As described in section 2.1, a connection request should be
   periodically attempted with the failed peer in order to re-establish
   the transport connection. Once a connection has been successfully
   established, messages can once again be forwarded to the peer. This
   is commonly referred to as failback.


8.0  Peer State Machine

   This section contains a finite state machine, that MUST be observed
   by all Diameter implementations. Each Diameter node MUST follow the
   state machine described below when communicating with each peer.
   Multiple actions are separated by commas, and may continue on
   succeeding lines as space requires. Similarly, state and next state
   may also span multiple lines as space requires.

   There may be at most one transport connection between any two peers
   over which Diameter messages may be passed. This state machine is
   intended to handle both the simple case, in which one peer initiates
   a connection to the other, and the complex case, in which each peer
   simultaneously initiates a connection to the other. In the complex
   case, an election occurs to determine which transport connection will
   survive.

   I- is used to represent the initiator (connecting) connection, while
   the R- is used to represent the responder (listening) connection. The
   lack of a prefix indicates that the event or action is the same
   regardless of the connection on which the event occurred.

   The stable states that a state machine may be in are Closed, I-Open
   and R-Open; all other states are intermediate. Note that I-Open and
   R-Open are equivalent except for whether the initiator or responder
   transport connection is used for communication.

   A DRI message is always sent on the responder connection immediately
   after accepting the connection request.  The non-elected connection
   will close down. All subsequent messages are sent on the elected
   connection.

   The state machine constrains only the behavior of a Diameter
   implementation as seen by Diameter peers through events on the wire.
   Any implementation that produces equivalent results is considered
   compliant.


      state            event              action         next state
      -----------------------------------------------------------------
      Closed           Start            I-Snd-Conn-Req   Wait-Conn-Ack



Calhoun et al.            expires October 2001                 [Page 35]





Internet-Draft                                                  May 2001


                       R-Rcv-Conn-Req   R-Snd-Conn-Ack   Wait-R-DRI

      Wait-Conn-Ack    I-Rcv-Conn-Ack   I-Snd-DRI        Wait-I-DRI
                       I-Rcv-Conn-Nack  Cleanup          Closed
                       R-Rcv-Conn-Req   R-Snd-Conn-Ack   Wait-Conn-Ack/
                                                         Wait-R-DRI
                       Timeout          Error            Closed

      Wait-I-DRI       I-Rcv-DRI        Process-DRI      I-Open
                       R-Rcv-Conn-Req   R-Snd-Conn-Ack   Wait-R-DRI/
                                                         Elect
                       I-Peer-Disc      I-Disc           Closed
                       Timeout          Error            Closed

      Wait-Conn-Ack/   I-Rcv-Conn-Ack   I-Snd-DRI        Wait-R-DRI/
      Wait-R-DRI                                         Elect
                       I-Rcv-Conn-Nack  Cleanup          Wait-R-DRI
                       R-Rcv-DRI        Process-DRI      Wait-Conn-Ack/
                                                         Elect
                       Timeout          Error            Closed

      Wait-R-DRI/      R-Rcv-DRI        Process-DRI,     Wait-Returns
      Elect                             Elect
                       I-Peer-Disc      I-Disc           Wait-R-DRI
                       Timeout          Error            Closed

      Wait-Conn-Ack/   I-Rcv-Conn-Ack   I-Snd-DRI,Elect  Wait-Returns
      Elect            I-Rcv-Conn-Nack  R-Snd-DRI        R-Open
                       R-Peer-Disc      R-Disc           Wait-Conn-Ack-2
                       Timeout          Error            Closed

      Wait-Returns     Win-Election     I-Disc,R-Snd-DRI R-Open
                       I-Peer-Disc      I-Disc,R-Snd-DRI R-Open
                       I-Rcv-DRI        R-Disc           I-Open
                       R-Peer-Disc      R-Disc           Wait-I-DRI-2
                       Timeout          Error            Closed

      Wait-Conn-Ack-2  I-Rcv-Conn-Ack   I-Snd-DRI        Wait-I-DRI-2
                       I-Rcv-Conn-Nack  Cleanup          Closed
                       R-Rcv-Conn-Req   R-Snd-Conn-Nack  Wait-Conn-Ack-2
                       Timeout          Error            Closed

      Wait-I-DRI-2     I-Rcv-DRI        Process-DRI      I-Open
                       I-Peer-Disc      I-Disc           Closed
                       R-Rcv-Conn-Req   R-Snd-Conn-Nack  Wait-I-DRI-2
                       Timeout          Error            Closed

      Wait-R-DRI       R-Rcv-DRI        R-Snd-DRI        R-Open



Calhoun et al.            expires October 2001                 [Page 36]





Internet-Draft                                                  May 2001


                       Timeout          Error            Closed

      R-Open           Send-Message     R-Snd-Non-DRI    R-Open
                       R-Rcv-Non-DRI    Process          R-Open
                       R-WatchDog-Timer R-Snd-DWR        R-Open
                       R-Rcv-DWA        Process-DWA      R-Open
                       Stop             R-Snd-Disc       Closed
                       R-Peer-Disc      R-Disc           Closed
                       R-Rcv-DRI        Error            Closed

      I-Open           Send-Message     I-Snd-Non-DRI    I-Open
                       I-Rcv-Non-DRI    Process          I-Open
                       I-WatchDog-Timer I-Snd-DWR        I-Open
                       I-Rcv-DWA        Process-DWA      I-Open
                       Stop             I-Disc           Closed
                       I-Peer-Disc      I-Disc           Closed
                       I-Rcv-DRI        Error            Closed
                       R-Rcv-Conn-Req   R-Snd-Conn-Nack  I-Open


8.1  States

   Following is a more detailed description of each automaton state.

      Closed         A peer is initially in the closed state, and no
                     transport connection exists with the peer.

      Wait-Conn-Ack  A transport connection has been initiated with the
                     peer, and an acknowledgement is pending.

      Wait-I-DRI     The local Diameter node is waiting for the peer to
                     issue a DRI.

      Wait-Conn-Ack/Wait-R-DRI
                     A transport connection indication from the peer was
                     received, while a transport connection has already
                     been locally initiated.

      Wait-R-DRI/Elect
                     Two transport connections have been established
                     with the peer, and a DRI is pending on the
                     responder connection.

      Wait-Conn-Ack/Elect
                     A transport connection exists on the responder
                     connection, while an acknowledgment has yet to be
                     received on the initiator connection.




Calhoun et al.            expires October 2001                 [Page 37]





Internet-Draft                                                  May 2001


      Wait-Returns   Multiple transport connections caused an election
                     to occur.

      Wait-Conn-Ack-2
                     While an acknowledgement to a locally initiated
                     transport connection hasn't been received, an
                     election has failed and the initiator connection
                     will be used between the peers.

      Wait-I-DRI-2   Following an election, the initiator connection
                     won, and a DRI has yet to be received by the peer.

      Wait-R-DRI     A transport connection indication has been received
                     from the peer, and a DRI has yet to be received by
                     the peer.

      R-Open         The responder connection will be used to
                     communicate with the peer.

      I-Open         The initiator connection will be used to
                     communicate with the peer.


8.2  Events

   Transitions and actions in the automaton are caused by events. In
   this section we will ignore the -I and -R prefix, since the actual
   event would be identical, but would occur on one of two possible
   connections.

      Start          The Diameter application has signaled that a
                     connection should be initiated with the peer.

      Rcv-Conn-Req   A transport connection indication from the peer has
                     been received.

      Rcv-Conn-Ack   A positive acknowledgement was received to a
                     locally initiated transport connection.

      Rcv-Conn-Nack  A negative acknowledgement was received to a
                     locally initiated transport connection.

      Timeout        An application-defined timer has expired while
                     waiting for some event.

      Rcv-DRI        A DRI message from the peer was received.

      Peer-Disc      A disconnection indication from the peer was



Calhoun et al.            expires October 2001                 [Page 38]





Internet-Draft                                                  May 2001


                     received.

      Win-Election   An election was held, and the local node was the
                     winner.

      Send-Message   A Non-DRI message is to be sent.

      Rcv-Non-DRI    A Non-DRI message was received.

      WatchDog-Timer The Watchdog timer expired, indicating that a DWR
                     message is to be sent to the peer.

      Rcv-DWA        A DWA message was received.

      Stop           The Diameter application has signaled that a
                     connection should be terminated (e.g., on system
                     shutdown).


8.3  Actions

   Actions in the automaton are caused by events and typically indicate
   the transmission of packets and/or an action to be taken on the
   connection. In this section we will ignore the -I and -R prefix,
   since the actual action would be identical, but would occur on one of
   two possible connections.

      Snd-Conn-Req   A transport connection is initiated with the peer.

      Snd-Conn-Ack   an acknowledgement is sent in response to a connect
                     request, confirming that the transport layer
                     connection is open.

      Snd-Conn-Nack  A negative acknowledgement is sent in response to a
                     connect request, indicating that the request was
                     refused.

      Snd-DRI        A DRI message is sent to the peer.

      Cleanup        If necessary, the connection is shutdown, and any
                     local resources are freed.

      Error          The transport layer connection is disconnected,
                     either politely or abortively, in response to an
                     error condition. Local resources are freed.

      Process-DRI    A received DRI is processed.




Calhoun et al.            expires October 2001                 [Page 39]





Internet-Draft                                                  May 2001


      Disc           The transport layer connection is disconnected, and
                     local resources are freed.

      Elect          An election occurs (see Section 8.4 for more
                     information).

      Snd-Non-DRI    A non-DRI message is sent.

      Snd-DWR        A DWR message is sent.

      Process-DWA    The DWA message is serviced.

      Process        A non-DRI Diameter message is serviced.


8.4  The Election Process

   The election is performed on the responder. The responder compares
   the Origin-FQDN received in the DRI sent by its peer with its own
   Origin-FQDN (which it may or may not have actually sent). The
   transport layer connection with the higher value of Origin-FQDN is
   the one that survives. The comparison proceeds by considering the
   shorter OctetString to be null-padded to the length of the longer,
   then performing an octet by octet unsigned comparison with the first
   octet being most significant. Hanging octets are assumed to have
   value 0x80, but dimpled octets are ignored.


9.0  Per-Hop Error Signaling

   There are many instances where error conditions occur on a Diameter
   node, that needs to be signaled to the downstream server, and not
   necessarily to the Diameter client. Examples of such error conditions
   are inability to forward a message to a particular domain, etc. In
   these cases, returning the error back to the Diameter client will
   only cause delay, and perhaps confusion in roaming networks.

   Therefore, when such errors occur, it is necessary for the error to
   be handled by the downstream next hop, and some local action be taken
   to rectify the problem, such as forwarding to a different next hop.











Calhoun et al.            expires October 2001                 [Page 40]





Internet-Draft                                                  May 2001


                      Request         +--------+ Link Broken
          +-------------------------->|Diameter|----///----+
          |     +---------------------|        |           v
   +-----+---+  |         DSI         | Server |     +--------+
   |Diameter |<-+ (Unable to Forward) +--------+     |Diameter|
   |Client or|                                       |        |
   | Server  |--+                     +--------+     | Server |
   +---------+  |      Request        |Diameter|     +--------+
                +-------------------->|        |           ^
                                      | Server |-----------+
                                      +--------+
               Figure 1 - Example of Per-Hop Error Condition


9.1  Device-Status-Ind

   The Device-Status-Ind (DSI), indicated by the Command-Code set to
   282, is sent to inform a peer that an event has occurred.

   When a Diameter node issues a DSI message downstream, the target peer
   MUST attempt to rectify the problem, or issue a similar message
   downstream. The Device-Status-Ind message MUST NOT be proxied, but
   MAY be forwarded, as long as the Origin-FQDN and Origin-Realm AVPs
   are replaced to include the local node's identity.

   The Device-Status-Ind message MUST contain the same Hop-by-Hop
   Identifier value in the header as the message which motivated sending
   the DSI.  If the Session-Id AVP was present in the original message,
   the same AVP MUST be present in the DSI.


   Message Format

      <Device-Status-Ind> ::= < Diameter Header: 282 >
                              { Origin-FQDN }
                              { Origin-Realm }
                              { DSI-Event }
                              [ Destination-FQDN ]
                              [ Session-Id ]
                            * [ AVP ]


9.1.1  DSI-Event AVP

   The DSI-Event AVP (AVP Code 297) is of type Unsigned32 and indicates
   that an event occurred which requires attention from a Diameter peer.
   The DSI-Event contains an IANA-managed 32-bit address space
   representing events (see section 17.5). Diameter provides the



Calhoun et al.            expires October 2001                 [Page 41]





Internet-Draft                                                  May 2001


   following classes of event notification, all identified by the
   thousands digit:
      - 1xxx (Informational Events)
      - 3xxx (Redirect Notification)
      - 4xxx (Transient Failure Events)
      - 5xxx (Permanent Failure Events)

   A non-recognize class (one whose first digit is not defined in this
   section) MUST be handled as a permanent failure.


9.1.1.1  Informational Events

   Events that fall within the Informational category are used to inform
   a peer that a request cannot be immediately satisfied, and a further
   response will be issued in the near future.

      DIAMETER_STILL_WORKING             1001
         A request's Max-Wait-Time has expired, and the request is still
         being serviced. This event MAY be sent prior to the Max-Wait-
         Time expiration, to inform the peer that the request is not
         expected to be serviced in the allotted time, but the request
         is not being abandoned. It is important to note that receiving
         this event will result in another Diameter message being
         received with the same Hop-by-Hop and End-to-End identifiers.


9.1.1.2  Redirect Event

   Errors that fall within the Redirect Event category are used to
   inform a peer that the request cannot be satisfied locally and should
   instead be forwarded to another server.

      DIAMETER_REDIRECT_INDICATION       3001
         A proxy or redirect server has determined that the request
         could not be satisfied locally and the initiator of the request
         should direct the request directly to the server, whose contact
         information has been added to the response.


9.1.1.3  Transient Failure Events

   Errors that fall within the transient failures category are used to
   inform a peer that the request could not be satisfied at the time it
   was received, but MAY be able to satisfy the request if the error is
   corrected.

      DIAMETER_UNSUPPORTED_TRANSFORM     4001



Calhoun et al.            expires October 2001                 [Page 42]





Internet-Draft                                                  May 2001


         A message was received that included an CMS-Data AVP [11] that
         made use of an unsupported transform.


9.1.1.4  Permanent Failure Events

   Errors that fall within the permanent failures category are used to
   inform the peer that the request failed, and cannot be satisfied by
   the originator of the Device-Status-Ind. The receiver of a DSI
   message with the DSI-Event set to a value that falls within this
   event class SHOULD forward the message to an alternate peer, if one
   is available.

      DIAMETER_INVALID_ROUTE_RECORD      5001
         The last Route-Record AVP in the message is not set to the
         identity of the sender of the message. See Section 12.0 for
         more information.

      DIAMETER_COMMAND_UNSUPPORTED       5002
         The Request contained a Command-Code that the receiver did not
         recognize or support. The Device-Status-Ind message MUST also
         contain an Failed-Command-Code AVP containing the unrecognized
         Command-Code.

      DIAMETER_UNABLE_TO_DELIVER         5003
         The request could not be delivered to a host that handles the
         realm, and extension, requested at this time.

      DIAMETER_REALM_NOT_SERVED          5004
         The originator of the DSI message could not deliver the message
         since the realm requested is unknown.

      DIAMETER_TOO_BUSY                  5005
         When returned, a Diameter node SHOULD attempt to sent the
         message to an alternate peer. This value MAY also be used to
         inform a peer that the request is not expected to be processed
         within the Max-Wait-Time value, and is giving up on the
         request.

      DIAMETER_CANNOT_PROCESS_IN_TIME    5006
         The time limit in a request's Max-Wait-Time AVP has expired,
         and no response is available.

      DIAMETER_NO_COMMON_EXTENSION       5007
         This event is returned when a DRI message is received, and
         there are no common extensions supported between the peer.

      DIAMETER_UNSUPPORTED_VERSION       5008



Calhoun et al.            expires October 2001                 [Page 43]





Internet-Draft                                                  May 2001


         This event is returned when a DRI message is received, and the
         Diameter message is unsupported.


10.0  End-to-End Error Signaling

   There are several different types of error conditions that can occur
   within Diameter.

   The first occurs when a Diameter message is poorly formatted, and
   unrecognizable, indicated in the figure below as "Bad Message". This
   error condition applies if a received message is less than the length
   of the Diameter header. Messages that generate such an error are
   ignored.

   A second case occurs when a Command-Code field is set to an
   unsupported value, which is shown as "Unknown Command" in the figure.
   Such errors generate a Device-Status-Ind message, and require per-hop
   behavior.

   A third case occurs when an AVP is received, marked as Mandatory ('M'
   bit is set), and is unknown by the receiver. This error condition is
   labeled as "Unknown AVP" in the figure below, and causes a Message-
   Reject-Ind message to be sent.

   The fourth case occurs when a message is received that contains an
   AVP with either an unknown or illegal value. This is labeled as "Bad
   AVP Value", and requires that a Message-Reject-Ind message be sent.

   The last two cases require that a Message-Reject-Ind message be
   generated to ensure that such errors are identified in both request
   and response messages.

   The last error condition occurs when an extension specific error is
   identified in a request or response message. In a message of type
   request or query, the natural corresponding answer or response
   message MUST be used. However, if an error occurs while processing an
   indication, answer or response message, a Message-Reject-Ind is used
   to inform the peer that an error occurred while processing the
   message.











Calhoun et al.            expires October 2001                 [Page 44]





Internet-Draft                                                  May 2001


   Error Type           Ignore       Send    Send     Send
                        Message      MRI     DSI      Response
   Bad Message             X
   Unknown Command                            X
   Unknown AVP                        X
   Bad AVP Value                      X
   Request,Query Error                                  X
   Answer,Response,Ind Error          X

   "Ignore Message" indicates that the message is simply dropped. "Send
   MRI" means that a Message-Reject-Ind message is sent to report the
   error condition, while "Send DSI" requires that a Device-Status-Ind
   message is sent (see Section 9.1). "Send Response" means that the
   response message for a request or query message is returned.


10.1  Message-Reject-Ind (MRI) Command

   The Message-Reject-Ind (MRI), indicated by the Command-Code set to
   259, provides a generic means of completing transactions by
   indicating errors in the messages that initiated them. The Message-
   Reject-Ind command is sent in response:

      1. An error is found in a message of type Ind, Answer and Response
      2. A Unknown AVP, marked as Mandatory, is received
      3. An AVP was received with an unknown, or illegal, value.

   The Message-Reject-Ind message MUST contain the same Hop-by-Hop
   Identifier value in the header as the message that caused the error
   condition. If the Session-Id AVP was present in the original message,
   the same AVP MUST be present in the MRI.

   Message Format


















Calhoun et al.            expires October 2001                 [Page 45]





Internet-Draft                                                  May 2001


      <Message-Reject-Ind message> ::= < Diameter Header: 259 >
                                       [ Session-Id ]
                                       { Result-Code }
                                       { Origin-FQDN }
                                       { Origin-Realm }
                                       { Destination-FQDN }
                                       { Error-Reporting-FQDN }
                                       [ Error-Message ]
                                       [ Failed-Command-Code ]
                                     * [ Failed-AVP ]
                                       [ Failed-Vendor-Id ]
                                       [ Destination-Realm ]
                                     * [ Proxy-Info ]
                                     * [ Route-Record ]
                                     * [ AVP ]

      where the Result-Code AVP indicate the nature of the error causing
      rejection, and the Failed-AVP AVP provides some minimal debugging
      data by indicating a specific AVP type which caused the problem.
      See the description of the Result-Code AVP for indication of when
      the Failed-AVP AVP MUST be present in the message.


10.1.1  Failed-AVP AVP

   The Failed-AVP AVP (AVP Code 279) is of type Grouped and provides
   debugging information in cases where a request is rejected or not
   fully processed due to erroneous information in a specific AVP. The
   value of the Result-Code AVP will provide information on the reason
   for the Failed-AVP AVP.

      Failed-AVP   = Offending-AVP Failed-Vendor-Id
         Offending-AVP      = ; See Section 10.1.4
         Failed-Vendor-Id   = ; See Section 10.1.5

   A Diameter message MAY contain one or more Failed-AVP AVPs, each
   containing a complete AVP that could not be processed successfully.
   The possible reasons for this AVP are the presence of an improperly
   constructed AVP, an unsupported or unrecognized AVP, an invalid AVP
   value, the omission of a required AVP, the presence of an explicitly
   excluded AVP (see table 14.0), or the presence of two or more
   occurrences of an AVP which table 16.1 restricts to 0, 1, or 0-1
   occurrences.








Calhoun et al.            expires October 2001                 [Page 46]





Internet-Draft                                                  May 2001


      +---------------------------------------------------------------+
      |                 AVP Header (AVP Code = 279)                   |
      +---------------------------------------------------------------+
      |                      Offending-AVP AVP                        |
      +---------------------------------------------------------------+
      |                    Failed-Vendor-Id AVP                       |
      +---------------------------------------------------------------+


10.1.2  Failed-Command-Code AVP

   The Failed-Command-Code AVP (AVP Code 270) is of type Grouped and
   provides and contains the offending Command-Code that resulted in
   sending the Message-Reject-Ind message.

      Failed-Command-Code   = Offending-Command-Code Failed-Vendor-Id
         Offending-Command-Code  = ; See Section 10.1.3
         Failed-Vendor-Id        = ; See Section 10.1.5

      +---------------------------------------------------------------+
      |                 AVP Header (AVP Code = 270)                   |
      +---------------------------------------------------------------+
      |                 Offending-Command-Code AVP                    |
      +---------------------------------------------------------------+
      |                    Failed-Vendor-Id AVP                       |
      +---------------------------------------------------------------+


10.1.3  Offending-Command-Code AVP

   The Failed-Command-Code AVP (AVP Code 272) is of type Unsigned32 and
   contains the offending Command-Code that resulted in sending the
   Message-Reject-Ind message.


10.1.4  Offending-AVP AVP

   The Failed-Command-Code AVP (AVP Code 271) is of type OctetString and
   contains the offending AVP.


10.1.5  Failed-Vendor-Id AVP

   The Failed-Vendor-Id AVP (AVP Code 262) is of type Unsigned32 and
   contains the Vendor-Id of the Command-Code or AVP that caused the
   error.





Calhoun et al.            expires October 2001                 [Page 47]





Internet-Draft                                                  May 2001


10.2  Result-Code AVP

   The Result-Code AVP (AVP Code 268) is of type Unsigned32 and
   indicates whether a particular request was completed successfully or
   whether an error occurred. All Diameter messages of type *-Response
   or *-Answer MUST include one Result-Code AVP, while messages of type
   -Ind MAY include the Result-Code AVP. A non-successful Result-Code
   AVP (one containing a non 2001 value) MUST include the Error-
   Reporting-FQDN AVP.

   The Result-Code data field contains an IANA-managed 32-bit address
   space representing errors (see section 17.4). Diameter provides the
   following classes of errors, all identified by the thousands digit:
      - 1xxx (Informational)
      - 2xxx (Success)
      - 4xxx (Transient Failures)
      - 5xxx (Permanent Failure)

   A non-recognize class (one whose first digit is not defined in this
   section) MUST be handled as a permanent failure.


10.2.1  Informational

   Errors that fall within the Informational category are used to inform
   a requester that the request cannot be immediately satisfied and a
   further response will be issued in the near future. There are
   currently no errors that fall within this class.


10.2.2  Success

   Errors that fall within the Success category are used to inform a
   peer that a request has been successfully completed.

      DIAMETER_SUCCESS                   2001
         The Request was successfully completed.


10.2.3  Transient Failures

   Errors that fall within the transient failures category are used to
   inform a peer that the request could not be satisfied at the time it
   was received, but MAY be able to satisfy the request in the future.

      DIAMETER_AUTHENTICATION_REJECTED   4001
         The authentication process for the user failed, most likely due
         to an invalid password used by the user. Further attempts MUST



Calhoun et al.            expires October 2001                 [Page 48]





Internet-Draft                                                  May 2001


         only be tried after prompting the user for a new password.

      DIAMETER_END_2_END_SECURITY        4002
         A proxy has detected that end-to-end security has been applied
         to portions of the Diameter message, and the proxy does not
         allow this security mode since it needs to alter the message by
         applying some local policies.
      DIAMETER_OUT_OF_SPACE              4003
         A Diameter node received the accounting request but was unable
         to commit it to stable storage due to a temporary lack of
         space.


10.2.4  Permanent Failures

   Errors that fall within the permanent failures category are used to
   inform the peer that the request failed, and should not be attempted
   again.

      DIAMETER_USER_UNKNOWN              5001
         A request was received for a user that is unknown, therefore
         authentication and/or authorization failed.

      DIAMETER_AVP_UNSUPPORTED           5002
         The peer received a message that contained an AVP that is not
         recognized or supported and was marked with the Mandatory bit.
         A Diameter message with this error MUST contain one or more
         Failed-AVP AVP containing the AVPs that caused the failure.

      DIAMETER_UNKNOWN_SESSION_ID        5003
         The request or response contained an unknown Session-Id.

      DIAMETER_AUTHORIZATION_REJECTED    5004
         A request was received for which the user could not be
         authorized.  This error could occur if the service requested is
         not permitted to the user.

      DIAMETER_INVALID_AVP_VALUE         5005
         The request contained an AVP with an invalid value in its data
         portion. A Diameter message indicating this error MUST include
         the offending AVPs within a Failed-AVP AVP.

      DIAMETER_MISSING_AVP               5006
         The request did not contain an AVP that is required by the
         Command Code definition. If this value is sent in the Result-
         Code AVP, a Failed-AVP AVP SHOULD be included in the message.
         The data portion of the Failed-AVP MUST only contain the AVP
         Code of the missing AVP.



Calhoun et al.            expires October 2001                 [Page 49]





Internet-Draft                                                  May 2001


      DIAMETER_INVALID_CMS_DATA          5007
         The Request did not contain a valid CMS-Data [11] AVP.

      DIAMETER_LOOP_DETECTED             5008
         A Proxy or Redirect server detected a loop while trying to get
         the message to the Home Diameter server. The message MAY be
         sent to an alternate peer, if one is available, but the peer
         reporting the error has identified a configuration problem.

      DIAMETER_AUTHORIZATION_FAILED      5009
         A request was received for which the user could not be
         authorized at this time. This error could occur when the user
         has already expended allowed resources, or is only permitted to
         access services within a time period.

      DIAMETER_CONTRADICTING_AVPS        5010
         The Home Diameter server has detected AVPs in the request that
         contradicted each other, and is not willing to provide service
         to the user. One or more Failed-AVP AVPs MUST be present,
         containing the AVPs that contradicted each other.

      DIAMETER_AVP_NOT_ALLOWED           5011
         A message was received with an AVP that MUST NOT be present.
         The Failed-AVP AVP MUST be included and contain the AVP Code of
         the offending AVP.

      DIAMETER_AVP_OCCURS_TOO_MANY_TIMES 5012
         A message was received that included an AVP that appeared more
         often than permitted in the message definition. The Failed-AVP
         AVP MUST be included and contain the AVP Code of the offending
         AVP.

      DIAMETER_VENDOR_ID_UNSUPPORTED     5013
         The Home Diameter server has detected vendor-specific AVPs in
         the message, and the vendor dictionary is not supported. One or
         more Failed-AVP MUST be present, containing the offending AVPs.

10.3  Error-Message AVP

   The Error-Message AVP (AVP Code 281) is of type OctetString.  It is a
   human readable UTF-8 character encoded string.  It MAY accompany a
   Result-Code AVP as a human readable error message. The Error-Message
   AVP is not intended to be useful in real-time, and SHOULD NOT be
   expected to be parsed by network entities.


10.4  Error-Reporting-FQDN AVP




Calhoun et al.            expires October 2001                 [Page 50]





Internet-Draft                                                  May 2001


   The Error-Reporting-FQDN AVP (AVP Code 294) is of type OctetString,
   encoded in the UTF-8 [24] format.  This AVP contains the FQDN of the
   Diameter host that set the Result-Code AVP to a value other than 2001
   (Success). This AVP is intended to be used for troubleshooting
   purposes, and MUST be set when the Result-Code AVP indicates a
   failure.


11.0  "User" Sessions

   Diameter can provide two different type of services to applications.
   The first involves authentication and authorization, and can
   optionally make use of accounting. The second only makes use of
   accounting.

   When a service makes use of the authentication and/or authorization
   portion of an extension, and a user requests access to the network,
   the Diameter client issues an auth request to its local server. The
   auth request is defined in a service specific Diameter extension
   (e.g. NASREQ). The request contains a Session-Id AVP, which is used
   in subsequent messages (e.g. subsequent authorization, accounting,
   etc) relating to the user's session. The Session-Id AVP is a means
   for the client and servers to correlate a Diameter message with a
   user session.

   When a Diameter server authorizes a user to use network resources, it
   SHOULD add the Authorization-Lifetime AVP to the response. The
   Authorization-Lifetime AVP defines the maximum amount of time a user
   MAY make use of the resources before another authorization request is
   to be transmitted to the server. If the server does not receive
   another authorization request before the timeout occurs, it SHOULD
   release any state information related to the user's session. Note
   that the Authorization-Lifetime AVP implies how long the Diameter
   server is willing to pay for the services rendered, therefore a
   Diameter client SHOULD NOT expect payment for services rendered past
   the session expiration time.

   The base protocol does not include any authorization request
   messages, since these are largely application-specific and are
   defined in a Diameter protocol extension document. However, the base
   protocol does define a set of messages that are used to terminate
   user sessions. These are used to allow servers that maintain state
   information to free resources.

   When a service only makes use of the Accounting portion of the
   Diameter protocol, even in combination with an extension, the
   Session-Id is still used to identify user sessions. However, the
   session termination messages are not used, since a session is



Calhoun et al.            expires October 2001                 [Page 51]





Internet-Draft                                                  May 2001


   signaled as being terminated by issuing an accounting stop message.


11.1  Authorization Session State Machine

   This section contains a finite state machine, representing the life
   cycle of Diameter sessions, and MUST be observed by all Diameter
   implementations that makes use of the authentication and/or
   authorization portion of a Diameter extension. The term Service-
   Specific below refers to a message defined in a Diameter extension
   (e.g. Mobile IP, NASREQ).

   The following table contains the authorization session state machine.

      State     Event                          Action     New State
      -------------------------------------------------------------
      Idle      Client or Device Requests      send serv. Pending
                access                         specific
                                               auth req

      Idle      Service-Specific authorization send serv. Open
                request received, and          specific
                successfully processed         response

      Pending   Successful Service-Specific    Grant      Open
                Authorization response         Access
                received

      Open      Authorization-Lifetime expires send serv. Open
                                               specific
                                               auth req

      Open      Successful Service-Specific    Extend     Open
                Authorization response         Access
                received

      Open      Accounting message sent or     process    Open
                received

      Open      Failed Service-Specific        Discon.    Closed
                Authorization response         user/device
                received.

      Open      Session-Timeout Expires on     send STR   Discon
                Access Device

      Open      STI Received                   send STR   Discon




Calhoun et al.            expires October 2001                 [Page 52]





Internet-Draft                                                  May 2001


      Open      Session-Timeout Expires on     send STI   Discon
                home AAA server

      Discon    STI Received                   ignore     Discon

      Discon    STR Received                   Send STA   Closed

      Discon    STA Received                   Discon.    Closed
                                               user/device

      Closed    Transition to state            Cleanup

   When the Cleanup action is invoked, the Diameter node MAY attempt to
   release all resources for the particular session. Any event not
   listed above MUST be considered as an error condition, and a
   response, if applicable, MUST be returned to the originator of the
   message.


11.2  Accounting Session State Machine

   For applications that only require accounting services, the following
   state machine MUST be supported.

      State     Event                          Action     New State
      -------------------------------------------------------------
      Idle      Client or device requests      send       Pending
                access                         accounting
                                               start req.

      Idle      Accounting start request       send       Open
                received, and successfully     accounting
                processed.                     start
                                               answer

      Pending   Successful accounting          grant      Open
                start answer received          access

      Open      User service terminated        send       Discon
                                               accounting
                                               stop req.

      Open      Accounting stop request        send       Closed
                received, and successfully     accounting
                processed                      stop answer

      Discon    Successful accounting          discon.    Closed
                stop answer received           user/device



Calhoun et al.            expires October 2001                 [Page 53]





Internet-Draft                                                  May 2001


11.3  Session-Id AVP

   The Session-Id AVP (AVP Code 263) is of type OctetString and is used
   to identify a specific session (see section 11.0). The Session-Id
   data uses the UTF-8 [24] character set. All messages pertaining to a
   specific session MUST include only one Session-Id AVP and the same
   value MUST be used throughout the life of a session. When present,
   the Session-Id SHOULD appear immediately following the Diameter
   Header (see section 3.0).

   For messages that do not pertain to a specific session, multiple
   Session-Id AVPs MAY be present as long as they are encapsulated
   within an AVP of type Grouped.

   The Session-Id MUST be globally unique at any given time since it is
   used by the server to identify the session (or flow). The format of
   the session identifier SHOULD be as follows:

   <Sender's Origin-FQDN><sender's port number> <monotonically
   increasing 32 bit value><optional value>

   The monotonically increasing 32 bit value SHOULD NOT start at zero
   upon reboot, but rather start at a random value. This will minimize
   the possibility of overlapping Session-Ids after a reboot.
   Alternatively, an implementation MAY keep track of the increasing
   value in non-volatile memory. The optional value is implementation
   specific but may include a modem's device Id, a layer 2 address,
   timestamp, etc.

   The session Id is created by the Diameter device initiating the
   session, which in most cases is done by the client. Note that a
   Session-Id MAY be used by more than one extension (e.g.
   authentication for a specific service and accounting, both of which
   have separate extensions).


11.4  Authorization-Lifetime AVP

   The Authorization-Lifetime AVP (AVP Code 291) is of type Unsigned32
   and contains the maximum number of seconds of service to be provided
   to the user before the user is to be re-authenticated and/or re-
   authorized. Great care should be taken when the Authorization-
   Lifetime value is determined, since a low value could create
   significant Diameter traffic, which could congest both the network
   and the servers.

   This AVP MAY be provided by the client as a hint of the maximum
   duration that it is willing to accept. However, the server DOES NOT



Calhoun et al.            expires October 2001                 [Page 54]





Internet-Draft                                                  May 2001


   have to observe the hint, and MAY return a value that is smaller than
   the hint. A value of zero means that no re-authorization is required.


11.5  Session-Timeout AVP

   The Session-Timeout AVP (AVP Code 27) [1] is of type Unsigned32 and
   contains the maximum number of seconds of service to be provided to
   the user before termination of the session. A value of zero means
   that this session has an unlimited number of seconds before
   termination.

   This AVP MAY be provided by the client as a hint of the maximum
   duration that it is willing to accept. However, the server DOES NOT
   have to observe the hint, and MAY return a value that is smaller than
   the hint.


11.6  User-Name AVP

   The User-Name AVP (AVP Code 1) [1] is of type OctetString, which
   contains the User-Name.  The value is represented as a UTF-8
   character encoded string in a format consistent with the NAI
   specification [8].


11.7  Max-Wait-Time AVP

   The Max-Wait-Time AVP (AVP Code 295) is of type Unsigned32, and
   contains the maximum amount of time the downstream server is willing
   to wait for a response. A server that determines that it cannot
   satisfy a request within the requested time MUST issue a DSI message
   with the DSI-Event set to DIAMETER_STILL_WORKING or
   DIAMETER_CANNOT_PROCESS_IN_TIME.


11.8  Session Movement

   There are applications that over the course of a session a user MAY
   receive service from different access servers. While the service is
   relocated, it MAY be desirable for the AAA infrastructure to view
   this as a persistent session, as opposed to a new session each time a
   user is relocated. In order to support these applications, when an
   AAA server identifies that a request is the continuation of an
   existing session, it MUST include the original session identifier in
   the Original-Session-Id AVP in the corresponding response message to
   the access device.




Calhoun et al.            expires October 2001                 [Page 55]





Internet-Draft                                                  May 2001


11.8.1  Original-Session-Id AVP

   The Original-Session-Id AVP (AVP Code 261) is of type OctetString and
   MAY be sent in a message of type Response or Answer if a AAA server
   already has a session identifier for the user, and wishes to keep the
   existing Session-Id. All further messages from the Access Device for
   this session MUST use the session identifier in this AVP. This
   shouldn't be viewed as a new session, but rather renaming the old
   session. Any further messages not using the Session Id in this AVP
   will be treated as an unrecognized Session Id.


11.9  Session Termination

   The Diameter Base Protocol provides a set of messages that MUST be
   used by any peer to explicitly request that a previously
   authenticated and/or authorized session be terminated. Since the
   Session-Id is typically tied to a particular service (i.e. Mobile IP,
   NASREQ, etc), the session termination messages are used to request
   that the service tied to the Session Id be terminated.

   Session Termination MAY be initiated by a Diameter server, by issuing
   a Session-Termination-Ind (STI) message to the access device. An
   access device MUST issue a Session-Termination-Request (STR) message
   either upon receipt of an STI, or when service to a particular user
   is terminated.

   A Diameter server MUST be prepared to clean up resources if a
   session's authorization lifetime has expired, and no STR was
   received. This event could occur if an access device was to
   unexpectedly reboot.

   An access device MUST issue Session-Termination-Request messages for
   all active session prior to an orderly reboot.


11.9.1  Session-Termination-Ind

   The Session-Termination-Ind (STI), indicated by the Command-Code set
   to 274, MAY be sent by any Diameter entity to the access device to
   request that a particular session be terminated. This message MAY be
   used when a server detects that a session MUST be terminated, which
   is typically done as a policy decision (e.g. local resources have
   been expended, etc). The Destination-FQDN AVP MUST be present, and
   contain the fully qualified domain name of the access device that
   initiated the session (see section 11.0).

   Upon receipt of the STI message, the access device MUST issue a



Calhoun et al.            expires October 2001                 [Page 56]





Internet-Draft                                                  May 2001


   Session-Terminate-Request message.

   Message Format

      <Session-Termination-Ind>  ::= < Diameter Header: 274 >
                                     < Session-Id >
                                     { Origin-FQDN }
                                     { Origin-Realm }
                                     { User-Name }
                                     { Destination-Realm }
                                     { Destination-FQDN }
                                   * [ AVP ]
                                   * [ Proxy-Info ]


11.9.2  Session-Termination-Request

   The Session-Termination-Request (STR), indicated by the Command-Code
   set to 275, is sent by the access device to inform the Diameter
   Server that an authenticated and/or authorized session is being
   terminated.

   Message Format

      <Session-Termination-Request>  ::= < Diameter Header: 275 >
                                         < Session-Id >
                                         { Origin-FQDN }
                                         { Origin-Realm }
                                         { User-Name }
                                         { Destination-Realm }
                                         { Destination-FQDN }
                                       * [ AVP ]
                                       * [ Proxy-Info ]
                                       * [ Route-Record ]


11.9.3  Session-Termination-Answer

   The Session-Termination-Answer (STA), indicated by the Command-Code
   set to 276, is sent by the Diameter Server to acknowledge that the
   session has been terminated. The Result-Code AVP MUST be present, and
   MAY contain an indication that an error occurred while servicing the
   STR.

   Upon sending or receipt of the STA, the Diameter Server MUST release
   all resources for the session indicated by the Session-Id AVP. Any
   intermediate server in the Proxy-Chain MAY also release any
   resources, if necessary.



Calhoun et al.            expires October 2001                 [Page 57]





Internet-Draft                                                  May 2001


   Message Format

      <Session-Termination-Answer>  ::= < Diameter Header: 276 >
                                        < Session-Id >
                                        { Result-Code }
                                        { Origin-FQDN }
                                        { Origin-Realm }
                                        { Destination-FQDN }
                                        { User-Name }
                                      * [ AVP ]
                                      * [ Proxy-Info ]
                                      * [ Route-Record ]


12.0  Message Routing

   This section describes the expected behavior of a Diameter server
   acting as a proxy or redirect server.


12.1  Realm-Based Message Routing

   Diameter request, query and indication message routing is done
   through the use of the realm portion of the Network Access Identifier
   (NAI) or via a realm encoded in an AVP (e.g. Origin-Realm,
   Destination-Realm), and an associated realm routing table (see
   section 12.1.1).

   When an NAI is used, the realm portion of the user@realm is used to
   perform the realm lookup. Diameter servers have a list of locally
   supported realms, and MAY have a list of externally supported realms.
   When a request, query or indication message is received that includes
   a realm that is not locally supported, the message is proxied to the
   Diameter entity configured in the "route" table.

   Figure 2 depicts an example where DIA1 is an access device and
   receives a request for network access from jow@abc.com. DIA1 looks up
   "abc.com" in its local realm route table and determines that the
   message must be proxied to DIA2. DIA2 does the same check, and
   proxies the message to DIA3. DIA3 checks its realm route table, and
   determines that the realm is locally supported, and processes the
   authentication request, and returns the response. How the response
   actually makes it back to the sender of the original request is
   described in the next section.







Calhoun et al.            expires October 2001                 [Page 58]





Internet-Draft                                                  May 2001


          (Origin-FQDN=dia1.mno.net)   (Origin-FQDN=dia1.mno.net)
          (Origin-Realm=mno.net)       (Origin-Realm=mno.net)
          (Destination-Realm=abc.com)  (Destination-Realm=abc.com)
                                       (Route-Record=dia2.xyz.com)
      +------+      ------>      +------+      ------>      +------+
      |      |     (Request)     |      |      (Request)    |      |
      | DIA1 +-------------------+ DIA2 +-------------------+ DIA3 |
      |      |                   |      |                   |      |
      +------+      <------      +------+      <------      +------+
      mno.net      (Response)    xyz.com      (Response)     abc.com
          (Origin-FQDN=dia3.abc.com)   (Origin-FQDN=dia3.abc.com)
          (Origin-Realm=abc.com)       (Origin-Realm=abc.com)
      (Destination-FQDN=dia1.mno.net)  (Destination-FQDN=dia1.mno.net)
                                       (Route-Record=dia2.xyz.com)
                       Figure 2: Realm-Based Routing

   Note the processing rules contained in this section are intended to
   be used as general guidelines to Diameter developers. Certain
   implementations MAY use different methods than the ones described
   here, and still be in compliance with the protocol specification.


12.1.1  Realm-Based Routing Table

   All Realm-Based routing lookups are performed against what is
   commonly known as the Domain Routing Table (see section 19.0). A
   Domain Routing Table Entry contains the following fields:
      - Domain Name. The Domain Name is analogous to the realm portion
        of the NAI.  This is the field that is typically used as a
        primary key in the routing table lookups. Note that some
        implementations perform their lookups based on longest-match-
        from-the-right on the realm rather than requiring an exact
        match.
      - Extension Id. It is possible for a routing entry to have a
        different destination based on the extension identifier of the
        message. This field is typically used as a secondary key field
        in routing table lookups.
      - Local Action. The Local Action field is used to identify how a
        message should be treated. The following actions are supported:
           1. LOCAL - Diameter messages that resolve to a routing entry
              with the Local Action set to Local can be satisfied
              locally, and do not need to be forwarded to another
              server.
           2. PROXY - All Diameter messages that fall within this
              category MUST be forwarded to a next hop server. The local
              server MAY apply its local policies to the message by
              including new AVPs to the message prior to forwarding.
              See section 12.4 for more information.



Calhoun et al.            expires October 2001                 [Page 59]





Internet-Draft                                                  May 2001


           3. REDIRECT - Diameter messages that fall within this
              category MUST have the identity of the home Diameter
              server(s) appended, and returned to the sender of the
              message. See section 12.3 for more information.
      - Server Identifier - One or more servers the message is to be
        forwarded to.  When the Local Action is set to PROXY, this field
        contains the identities of the server(s) the message must be
        forwarded to. When the Local Action field is set to REDIRECT,
        this field contains the Home Diameter server(s) for the realm.

   It is important to note that Diameter servers MUST support at least
   one of the PROXY, REDIRECT, or LOCAL modes of operation. Servers do
   not need to support all modes of operation in order to conform with
   the protocol specification. Servers MUST NOT reorder AVPs with the
   same AVP Code.

   When a message is being proxied, the servers in a given domain
   routing entry MUST have advertised the Extension Identifier (see
   section 6.1) for the given message, or have advertised the Wildcard
   Extension.


12.2  Proxy and Redirect Server handling of requests

   When a message of type request, query or indication is received by a
   proxy or redirect server, and it is determined that the request
   cannot be locally handled, the next hop for the request is determined
   in the following order:
      1. If the Destination-FQDN AVP is present, and the host specified
         in the AVP can be directly contacted, the message is forwarded
         to the host (see section 5.1 for more information), or
      2. If the Destination-Realm AVP is present, a routing table lookup
         is performed using the domain specific in the AVP.

   A message that does not contain any of the above AVPs MUST NOT be
   routed.  If the message in question cannot be handled locally, a
   Message-Reject-Ind is sent with the Result-Code AVP set to an
   appropriate error condition.


12.3  Redirect Server

   A Redirect Server is one that provides Realm to Diameter Home Server
   address resolution. When a message is received by a peer, the
   Destination-Realm AVP (or the User-Name AVP if the Destination-Realm
   AVP is not present) is extracted from the message, and is used to
   perform a lookup in the domain routing table. Implementations MAY
   also use the Extension Identifiers as a secondary key in the domain



Calhoun et al.            expires October 2001                 [Page 60]





Internet-Draft                                                  May 2001


   routing table lookup.

   Successful routing table lookups will return one or more home
   Diameter servers that could satisfy the message. The home servers are
   encoded in one or more Redirect-Host AVPs, and the Command-Code field
   is set to Device-Status-Ind.

                             +------------------+
                             |     Diameter     |
                             | Redirect Server  |
                             +------------------+
                              ^    |
                      Request |    | DSI +
                  joe@xyz.com |    | DSI-Event = Redirect +
                              |    | Redirect-Host AVP(s)
                              |    v
                            +----------+   Request    +----------+
                            | abc.net  |------------->| xyz.net  |
                            | Diameter |              | Diameter |
                            |  Server  |<-------------|  Server  |
                            +----------+   Response   +----------+
                    Figure 3: Diameter Redirect Server

   Lastly, the DSI-Event AVP is added with the Data field of the AVP set
   to DIAMETER_REDIRECT_INDICATION, and the message is returned to the
   sender of the request. Redirect servers MAY also include the
   certificate of the Home server(s). These certificates are
   encapsulated in a CMS-Cert AVP [11].  When this occurs, the server
   forwarding the request directly to the Home Diameter server SHOULD
   include its own certificate in the message.


12.3.1  Redirect-Host AVP

   The Redirect-Host AVP (AVP Code 292) is of type Grouped and is found
   in Device-Status-Ind messages that include the DSI-Event AVP set to
   DIAMETER_REDIRECT_INDICATION. This AVP only needs to be used if the
   host the message is to be redirected to is not listening on the
   standard Diameter port. Its Data field has the following ABNF
   grammar:

      Redirect-Host   = Redirect-Host-Address Redirect-Host-Port
         Redirect-Host-Address = ; See Section 12.3.2
         Redirect-Host-Port    = ; See Section 12.3.3

   The Redirect-Host-Address AVP Data field contains the IP Address of
   the Diameter host to which the request MUST be redirected. The
   Redirect-Host-Port contains the port number to which the request



Calhoun et al.            expires October 2001                 [Page 61]





Internet-Draft                                                  May 2001


   should be sent. Upon receipt of such a event, and this AVP, the
   receiving host SHOULD send the request directly to the host
   identified by the Redirect-Host-Address AVP.

      +---------------------------------------------------------------+
      |                 AVP Header (AVP Code = 292)                   |
      +---------------------------------------------------------------+
      |                  Redirect-Host-Address AVP                    |
      +---------------------------------------------------------------+
      |                    Redirect-Host-Port AVP                     |
      +---------------------------------------------------------------+

12.3.2  Redirect-Host-Address AVP

   The Redirect-Host-Address AVP (AVP Code 278) is of type Address.  Its
   use is described in Section 12.3.1.


12.3.3  Redirect-Host-Port AVP

   The Redirect-Host-Port AVP (AVP Code 277) is of type Unsigned32.  Its
   use is described in Section 12.3.1.


12.4  Proxy Server

   This section outlines the processing rules for Diameter proxy
   servers.  A proxy server can either be stateful or stateless. A Proxy
   server MAY act in a stateful manner for some requests, and be
   stateless for others. There are two types of states that servers MAY
   wish to maintain; transaction and session.

   Maintaining transaction state implies that a server keeps a copy of a
   request or query messages, which is then used when the corresponding
   response is received. Maintaining transaction state also requires
   that the Hop-by-Hop identifier MUST be saved, and restored to its
   original value when the corresponding response message is received. A
   Proxy server MAY also add a Proxy-Info AVP to request and query
   message, but MUST remove the AVP in the corresponding response.

   Maintaining session state implies that a server keeps track of all
   "active" users. An active user is one that has been authorized for a
   particular service, and the server has not received any indication
   that the user has relinquished access.

   A stateless proxy is one that does not maintain session state, but
   MUST maintain transaction state. Transaction state SHOULD be released
   after a request's corresponding response has been forwarded towards



Calhoun et al.            expires October 2001                 [Page 62]





Internet-Draft                                                  May 2001


   the recipient, and has been acknowledged by the underlying transport.

   A stateful proxy is one that maintains both transaction and session
   state, the latter being done by observing request and responses.
   Session state SHOULD be released once it is informed that a user
   and/or device has relinquished access. A stateful server MAY provide
   the following features:
      - Protocol translation (e.g. RADIUS <-> Diameter)
      - Limiting resources authorized to a particular user
      - Per user or transaction auditing

   Home servers processing requests that include the Route-Record and/or
   the Proxy-Info AVPs MUST return these AVPs in the same order in the
   corresponding response.


12.4.1  Proxying Request, Query and Indication messages

   In addition to the rules defined in section 12.2, the following
   procedures MUST be handled by proxy servers handling messages of type
   request, query or indication.

   A proxy server MUST check for forwarding loops before proxying a
   message of type Request, Query or Indication. Such as message has
   been looped if the server finds its own address in a Route-Record
   AVP.

   A Diameter server that proxies a message of type Request, Query or
   Indication MUST append a Route-Record AVP, which includes its
   identity.  Diameter Servers that receive messages MUST validate the
   last Route-Record AVP in the message and ensure that the host
   identified in the AVP is the same as the sender of the message.

   A Proxy Server MAY also include the Proxy-Info AVP in a message of
   type Request or Query, which is used to encode local state
   information. The Proxy-Info AVP is guaranteed to be present in the
   corresponding response.

   The message is then forwarded to the downstream Diameter server, as
   identified in the Domain Routing Table.

   Proxy Server MUST save the Hop-by-Hop Identifier in request messages,
   if the value of the field is changed, with a locally unique value.
   The saved identifier MAY be encoded in the Proxy-Info AVP, and will
   be required in the processing of the corresponding response.


12.4.2  Proxying Response and Answer messages



Calhoun et al.            expires October 2001                 [Page 63]





Internet-Draft                                                  May 2001


   A proxy server MUST only process messages of type Response or Answer
   whose last Route-Record AVP matches one of its identities. Any
   responses that do not conform to this rule MUST be dropped. The last
   Route-Record AVP MUST be removed from the message before it is
   forwarded to the next hop, which is identified by the second to last
   Route-Record AVP.

   If the last Proxy-Info AVP in the message is targeted to the local
   Diameter server, the AVP MUST be removed.

   If a proxy server receives a response with a Result-Code AVP
   indicating a failure, it MUST NOT modify the contents of the AVP. Any
   additional local errors detected SHOULD be logged, but not reflected
   in the Result-Code AVP.

   Prior to forwarding the response, proxy servers MUST restore the
   original value of the Diameter header's Hop-by-Hop Identifier field.


12.4.3  Route-Record AVP

   The Route-Record AVP (AVP Code 282) is of type OctetString, encoded
   in the UTF-8 [24] format, and contains the Fully Qualified Domain
   Name of the Proxy appending this AVP to a Diameter message. The FQDN
   added in this AVP MUST be the same as the FQDN sent in the Origin-
   FQDN in the Device-Reboot-Ind message.


12.4.4  Proxy-Info AVP

   The Proxy-Info AVP (AVP Code = 284) is of type Grouped.  The Grouped
   Data field has the following ABNF grammar:

      Proxy-Info   = Proxy-Address Proxy-State
         Proxy-Address = ; See Section 12.4.5
         Proxy-State    = ; See Section 12.4.6

   The Proxy-Address AVP Data field contains one of the IP addresses of
   the system that created the AVP. This assists hosts in determining
   whether a Proxy-Info AVP is intended for the local host. The Proxy-
   State AVP contains state information, and MUST be treated as opaque
   data.









Calhoun et al.            expires October 2001                 [Page 64]





Internet-Draft                                                  May 2001


      +---------------------------------------------------------------+
      |                 AVP Header (AVP Code = 284)                   |
      +---------------------------------------------------------------+
      |                      Proxy-Address AVP                        |
      +---------------------------------------------------------------+
      |                       Proxy-State AVP                         |
      +---------------------------------------------------------------+


12.4.5  Proxy-Address AVP

   The Proxy-Address AVP (AVP Code = 280) is of type Address.  Its use
   is described in Section 12.4.4.


12.4.6  Proxy-State AVP

   The Proxy-State AVP (AVP Code = 33) is of type OctetString.  Its use
   is described in Section 12.4.4.


12.4.7  Destination-Realm AVP

   The Destination-Realm AVP (AVP Code 283) is of type OctetString,
   encoded in the UTF-8 [24] format, and contains the realm the message
   is to be routed to. The Destination-Realm AVP MUST NOT be present in
   messages of type Answer or Response. Diameter Clients insert the
   realm portion of the User-Name AVP. Home servers initiating a message
   of type Request, Query or Indication use the value of the Origin-
   Realm AVP from a previous message received from the intended target
   host (unless it is known a priori). When present, the Destination-
   Realm AVP is used to perform message routing decisions.


12.5  Applying Local Policies

   Proxies MAY apply local access policies to Diameter requests, or
   responses, by adding, changing or deleting AVPs in the messages.
   Proxies that apply local policies MUST NOT allow end-to-end security
   on any messages that traverse through it, unless security is
   terminated locally.

   A proxy wishing to modify a Diameter message to enforce some local
   policy that detects that end-to-end security has been applied to the
   message MUST return a response to the originator with the Result-Code
   set to DIAMETER_NO_END_2_END_SECURITY. The originator of the request
   MAY re-issue the request with no end-to-end security if it falls
   within its local policy.



Calhoun et al.            expires October 2001                 [Page 65]





Internet-Draft                                                  May 2001


   In the event that the Home Diameter server receives a request with
   contradictory information (possibly due to some proxy adding a local
   policy), it MAY accept the latest AVP, or MAY return the response
   with the Result-Code AVP set to DIAMETER_CONTRADICTING_AVPS. However,
   an access device receiving a response that contains contradictory
   information SHOULD reject service to the user.


12.6  Hiding Network Topology

   Stateful proxies forwarding requests to servers outside of their
   administrative domain MAY hide the internal network topology. Servers
   perform this by removing all Route-Record AVPs in the message, and
   maintains the Route-Record AVPs to add to the corresponding response.
   Such servers MUST still add their own Route-Record AVP to the request
   prior to forwarding.


12.7  Loop Detection

   When a Diameter Proxy or Redirect server receives a message of type
   Request, Query or Indication, it MUST examine all Route-Record AVPs
   in the message to determine whether such an AVP already exists with
   the local server's identity. If an AVP with the local host's identity
   is found in the request, it is an indication that the message is
   being looped through the same set of proxies. When such an event
   occurs, the Diameter server that detects the loop returns a response
   (or MRI if no response is possible) with the Result-Code AVP set to
   DIAMETER_LOOP_DETECTED.


13.0  Accounting

   This accounting protocol is based on an authorization-server directed
   model with capabilities for real-time delivery of accounting
   information. Several fault resilience methods [40] have been built in
   to the protocol in order minimize loss of accounting data in various
   fault situations and under different assumptions about the
   capabilities of the used devices.


13.1  Server Directed Model

   The server directed model means that the device generating the
   accounting data gets information from either the authorization server
   (if contacted) or the accounting server regarding the way accounting
   data shall be forwarded.  This information includes accounting record
   timeliness requirements.



Calhoun et al.            expires October 2001                 [Page 66]





Internet-Draft                                                  May 2001


   As discussed in [40], real-time transfer of accounting records is a
   requirement, such as the need to perform credit limit checks and
   fraud detection. Note that batch accounting is not a requirement, and
   is therefore not supported by this extension. Should Batched
   Accounting be required in the future, a new Diameter extension will
   need to be created, or it could be handled using another protocol.

   The authorization server (chain) directs the selection of proper
   transfer strategy, based on its knowledge of the user and
   relationships of roaming partnerships. The server (or proxies in
   between) uses the Accounting-Interim-Interval AVP to control the
   operation of the Diameter peer operating as a client. The
   Accounting-Interim-Interval AVP, when present, instructs the Diameter
   node acting as a client to produce accounting records continuously
   even during a session.

   The Diameter accounting server MAY override the interim interval by
   including an Accounting-Interim-Interval AVP in the Accounting-Answer
   message. When the AVP is present, the latest value received SHOULD be
   used in the generation of interim accounting messages.


13.2  Protocol Messages

   A Diameter node that receives a successful authentication and/or
   authorization messages from the Home AAA Server, MUST collect
   accounting information for the session. The Accounting-Request
   message is used to transmit the accounting information to the Home
   AAA server, which MUST reply with the Accounting-Answer message to
   confirm reception.  The Accounting-Answer message includes the
   Result-Code AVP, which MAY indicate that an error was present in the
   accounting message.  A rejected Accounting-Request message SHOULD
   cause the user's session to be terminated.

   Each Diameter Accounting protocol message MAY be compressed using
   IPComp [41] in order to reduce the used network bandwidth, which MAY
   use IKE [15] to negotiate the compression parameters.


13.3  Extension document requirements

   Each Service-Specific Diameter extension (e.g. NASREQ, MobileIP),
   MUST define their Service-Specific AVPs that MUST be present in the
   Accounting-Request message in a section entitled "Accounting AVPs".
   The extension MUST assume that the AVPs described in this document
   will be present in all Accounting messages, so only their respective
   service-specific AVPs need to be defined in this section.




Calhoun et al.            expires October 2001                 [Page 67]





Internet-Draft                                                  May 2001


13.4  Fault Resilience

   Diameter Base protocol mechanisms are used to overcome small message
   loss and network faults of temporary nature.

   Diameter peers acting as clients MUST implement the use of failover
   to guard against server failures and certain network failures.
   Diameter peers acting as servers or related off-line processing
   systems MUST detect duplicate accounting records caused by the
   sending of same record to several servers and duplication of messages
   in transit. This detection MUST be based on the inspection of the
   Session-Id and Accounting-Record-Number AVP pairs.

   Diameter clients MAY have non-volatile memory for the safe storage of
   accounting records over reboots or extended network failures, network
   partitions, and server failures.  If such memory is available the
   client SHOULD store new accounting records there as soon as the
   records are created and until a positive acknowledgement of their
   reception from the Diameter Server has been received. Upon a reboot,
   the client MUST starting sending the records in the non-volatile
   memory to the accounting server with appropriate modifications in
   termination cause, session length, and other relevant information in
   the records.

   A further extension of this protocol may include AVPs to control how
   many accounting records may at most be stored in the Diameter client
   without committing them to the non-volatile memory or transferring
   them to the Diameter server.

   The client SHOULD NOT remove the accounting data from any of its
   memory areas before the correct Accounting-Answer has been received.
   The client MAY remove oldest, undelivered or yet unacknowledged
   accounting data if it runs out of resources such as memory. It is an
   implementation dependent matter for the client to accept new sessions
   under this condition.


13.5  Accounting Records

   In all accounting records the Session-Id and User-Name AVPs MUST be
   present. If strong authentication is required, as described in [11],
   the CMS-Data AVP may be used to authenticate the Accounting Data and
   Service Specific AVPs. It is not typically necessary, nor
   recommended, that the strong authentication cover any additional AVPs
   since the Data and Service Specific AVP, and associated CMS-Data, MAY
   need to be submitted to a third party.

   Different types of accounting records are sent depending on the



Calhoun et al.            expires October 2001                 [Page 68]





Internet-Draft                                                  May 2001


   actual type of accounted service and the authorization server's
   directions for interim accounting. If the accounted service is a
   one-time event, meaning that the start and stop of the event are
   simultaneous, then the Accounting-Record-Type AVP MUST be present and
   set to the value EVENT_RECORD.

   If the accounted service is of a measurable length, then the AVP MUST
   use the values START_RECORD, STOP_RECORD, and possibly,
   INTERIM_RECORD.  If the authorization server has directed interim
   accounting to be enabled for the session, but no interim interval was
   specified, two accounting records MUST be generated for each service
   of type session.  When the initial Accounting-Request is sent for a
   given session is sent, the Accounting-Record-Type AVP MUST be set to
   the value START_RECORD. When the last Accounting-Request is sent, the
   value MUST be STOP_RECORD.

   If a specified interim interval exists, the Diameter client MUST
   produce additional records between the START_RECORD and STOP_RECORD,
   marked INTERIM_RECORD. The production of these records is directed
   both by Accounting-Interim-Interval as well as any re-authentication
   or re-authorization of the session.  The Diameter client MUST
   overwrite any previous interim accounting records that are locally
   stored for delivery, if a new record is being generated for the same
   session. This ensures that only one pending interim record can exist
   on an access device for any given session.


14.0  Accounting Command-Codes

   This section defines new Command-Code  values that MUST be supported
   by all Diameter implementations that provide Accounting services.


14.1  Accounting-Request (ACR) Command

   The Accounting-Request command, indicated by the Command-Code field
   set to 271, is sent by a Diameter node, acting as a client, in order
   to exchange accounting information with a peer.

   When the Accounting-Request is being submitted to a broker, and
   includes the CMS-Data AVP [11], the CMS-Data AVP MUST be signed by
   both the local and home Diameter server using the countersignature
   procedures described in [11].

   The AVP listed below SHOULD include service specific accounting AVPs,
   as described in section 13.3.





Calhoun et al.            expires October 2001                 [Page 69]





Internet-Draft                                                  May 2001


   Message Format

      <Accounting-Request> ::= < Diameter Header: 271 >
                               < Session-Id >
                               { Acct-Extension-Id }
                               { User-Name }
                               { Origin-FQDN }
                               { Origin-Realm }
                               { Destination-Realm }
                               { Accounting-Record-Type }
                               { Accounting-Record-Number }
                               [ Accounting-Interim-Interval ]
                               { Accounting-Session-Id }
                             * [ AVP ]
                               [ CMS-Data ]
                             * [ Proxy-Info ]
                             * [ Route-Record ]


14.2  Accounting-Answer (ACA) Command

   The Accounting-Answer command, indicated by the Command-Code field
   set to 272, is used to acknowledge an Accounting-Request command. The
   Accounting-Answer command contains the same Session-Id and MAY
   contains the same Accounting Description and Usage AVPs that were
   sent in the Accounting-Request command. If the CMS-Data AVP was
   present in the Accounting-Request, the corresponding ACA message MUST
   include the CMS-Data AVP signed by the responder to provide strong
   AVP authentication, which MAY be used for the purposes of
   repudiation.

   Only the target Diameter Server, known as the home Diameter Server,
   SHOULD respond with the Accounting-Answer command.

   The AVP listed below SHOULD include service specific accounting AVPs,
   as described in section 13.3.















Calhoun et al.            expires October 2001                 [Page 70]





Internet-Draft                                                  May 2001


   Message Format

      <Accounting-Answer> ::= < Diameter Header: 272 >
                              < Session-Id >
                              { Acct-Extension-Id }
                              { User-Name }
                              { Result-Code }
                              { Origin-FQDN }
                              { Origin-Realm }
                              { Destination-FQDN }
                              { Accounting-Record-Type }
                              { Accounting-Record-Number }
                              { Accounting-Session-Id }
                              [ Error-Reporting-FQDN ]
                              [ Accounting-Interim-Interval ]
                            * [ AVP ]
                              [ CMS-Data ]
                            * [ Proxy-Info ]
                            * [ Route-Record ]


14.3  Accounting-Status-Ind (ASI) Command

   The Accounting-Status-Ind command, indicated by the Command-Code
   field set to 279, is sent by a Diameter node in order to inform its
   peer of whether Accounting messages will be sent in the future. A
   Diameter node that is about to be taken out of service SHOULD issue
   an Accounting-Status-Ind message, with the Accounting-State AVP set
   to DISABLED. Prior to sending such a message, every attempt SHOULD be
   made to transmit any pending accounting messages.

   A Diameter node that detected that it is able to issue Accounting
   messages MUST issue an Accounting-Status-Ind message, with the
   Accounting-State AVP set to ENABLED.

   Message Format

      <Accounting-Status-Ind> ::= < Diameter Header: 279 >
                                  { Acct-Extension-Id }
                                  { Origin-FQDN }
                                  { Origin-Realm }
                                  { Destination-Realm }
                                  { Accounting-State }
                                * [ AVP ]
                                * [ Proxy-Info ]
                                * [ Route-Record ]





Calhoun et al.            expires October 2001                 [Page 71]





Internet-Draft                                                  May 2001


14.4  Accounting-Poll-Ind (API) Command

   The Accounting-Poll-Ind command, indicated by the Command-Code field
   set to 273, is sent by a Diameter Server in order to force the peer
   to send current accounting data. This data MUST include not yet sent
   accounting records from completed sessions, as well as INTERIM_RECORD
   records from all ongoing sessions.

   Diameter implementations MAY support the Accounting-Poll-Ind command.
   An implementation still conforms to this specification if API is not
   supported.

   The receiver MUST use the Accounting-Request command to send the
   accounting data.

   The use of Accounting-Poll-Ind is useful in situations where a
   Diameter server comes up after an unscheduled downtime, and wishes to
   synchronize with the client(s) sooner than at the end of the next
   INTERIM_RECORD or at the end of a session.

   Warning: The use of the Accounting-Poll-Ind message is discouraged in
   roaming networks, since it is unfeasible for a server to attempt to
   poll all of it's roaming partner's Diameter peers.

   Message Format

      <Accounting-Poll-Ind> ::= < Diameter Header: 273 >
                                < Session-Id >
                                { Acct-Extension-Id }
                                { Destination-FQDN }
                                { Origin-FQDN }
                                { Origin-Realm }
                                { Destination-Realm }
                                { Accounting-Session-Id }
                                [ Destination-FQDN ]
                              * [ AVP ]
                              * [ Proxy-Info ]
                              * [ Route-Record ]


15.0 Accounting AVPs

   This section contains AVPs that describe accounting usage information
   related to a specific session.


15.1  Accounting-Record-Type AVP




Calhoun et al.            expires October 2001                 [Page 72]





Internet-Draft                                                  May 2001


   The Accounting-Record-Type AVP (AVP Code 480) is of type Unsigned32
   and contains the type of accounting record being sent. The following
   values are currently defined for the Accounting-Record-Type AVP:

      EVENT_RECORD                    1
         An Accounting Event Record is used to indicate that a one-time
         event has occurred (meaning that the start and end of the event
         are simultaneous).  This record contains all information
         relevant to the service, and is the only record of the service.

      START_RECORD                    2
         An Accounting Start, Interim, and Stop Records are used to
         indicate that a service of a measurable length has been given.
         An Accounting Start Record is used to initiate an accounting
         session, and contains accounting information that is relevant
         to the initiation of the session.

      INTERIM_RECORD                  3
         An Interim Accounting Record contains cumulative accounting
         information for an existing accounting session. Interim
         Accounting Records SHOULD be sent every time a re-
         authentication or re-authorization occurs.  Further, additional
         interim record triggers MAY be defined by application-specific
         Diameter extensions. The selection of whether to use
         INTERIM_RECORD records is directed by the Accounting-Interim-
         Interval AVP.

      STOP_RECORD                     4
         An Accounting Stop Record is sent to terminate an accounting
         session and contains cumulative accounting information relevant
         to the existing session.


15.2  Accounting-Interim-Interval AVP

   The Accounting-Interim-Interval AVP (AVP Code 482) is of type
   Unsigned32 and is sent from the Diameter authenticating/authorizing
   server to the Diameter client. The client uses information in this
   AVP to decide how and when to produce accounting records. With
   different values in this AVP, service sessions can result in one,
   two, or two+N accounting records, based on the needs of the home-
   organization. The following accounting record production behavior is
   directed by the inclusion of this AVP:

      1. The omission of the Accounting-Interim-Interval AVP or its
         inclusion with Value field set to 0 means that EVENT_RECORD,
         START_RECORD, and STOP_RECORD are produced, as appropriate for
         the service.



Calhoun et al.            expires October 2001                 [Page 73]





Internet-Draft                                                  May 2001


      2. The inclusion of the AVP with Value field set to a non-zero
         value means that INTERIM_RECORD records MUST be produced
         between the START_RECORD and STOP_RECORD records.  The Value
         field of this AVP is the nominal interval between these records
         in seconds. The Diameter node that originates the accounting
         information, known as the client, MUST produce the first
         INTERIM_RECORD record roughly at the time when this nominal
         interval has elapsed from the START_RECORD, the next one again
         as the interval has elapsed once more, and so on until the
         session ends and a STOP_RECORD record is produced.

         The client MUST ensure that the interim record production times
         are randomized so that large accounting message storms are not
         created either among records or around a common service start
         time.


15.3  Accounting-Record-Number AVP

   The Accounting-Record-Number AVP (AVP Code 485) is of type Unsigned32
   and identifies this record within one session. As Session-Id AVPs are
   globally unique, the combination of Session-Id and Accounting-
   Record-Number AVPs is also globally unique, and can be used in
   matching accounting records with confirmations.  An easy way to
   produce unique numbers is to set the value to 0 for records of type
   EVENT_RECORD and START_RECORD, and set the value to 1 for the first
   INTERIM_RECORD, 2 for the second, and so on until the value for
   STOP_RECORD is one more than for the last INTERIM_RECORD.


15.4  Accounting-State AVP

   The Accounting-State AVP (AVP Code 486) is of type Unsigned32 and is
   used to communicate to a peer whether Accounting messages will be
   sent in the future. A node that issues an ASI with the Accounting-
   State AVP set to DISABLED is informing its peer that it will no
   longer be transmitting Accounting messages until a subsequent ASI
   message is sent with the Accounting-State AVP set to ENABLED.

   The following values have been defined:
      1      ENABLED
      2      DISABLED


15.5  Accounting-Session-Id AVP

   The Accounting-Session-Id AVP (AVP Code 44) is of type OctetString,
   and SHOULD be encoded in UTF-8 format [13]. The Accounting-Session-Id



Calhoun et al.            expires October 2001                 [Page 74]





Internet-Draft                                                  May 2001


   is not used by the Diameter protocol, since the Session-Id defined in
   [1] is used for both authentication/authorization and accounting
   purposes.  However, a RADIUS/Diameter gateway MAY need to include the
   Accounting-Session-Id in Diameter accounting messages.


16.0  AVP Occurrence Table

   The following tables presents the AVPs defined in this document, and
   specifies in which Diameter messages they MAY, or MAY NOT be present.
   Note that AVPs that can only be present within a Grouped AVP are not
   represented in this table.

   The table uses the following symbols:
      0      The AVP MUST NOT be present in the message.
      0+     Zero or more instances of the AVP MAY be present in the
            message.
      0-1    Zero or one instance of the AVP MAY be present in the
            message. It is considered an error if there are more than
            once instance of the AVP.
      1     One instance of the AVP MUST be present in the message.
      1+    At least one instance of the AVP MUST be present in the
            message.


16.1  Base Protocol Command AVP Table

   The table in this section is limited to the non-accounting Command
   Codes defined in this specification.






















Calhoun et al.            expires October 2001                 [Page 75]





Internet-Draft                                                  May 2001


                                 +-------------------------------+
                                 |          Command-Code         |
                                 |---+---+---+---+---+---+---+---+
   Attribute Name                |DRI|DSI|DWR|DWA|MRI|STI|STR|STA|
   ------------------------------|---+---+---+---+---+---+---+---|
   Auth-Extension-Id             |1+ |0  |0  |0  |0  |0  |0  |0  |
   Authorization-Lifetime        |0  |0  |0  |0  |0  |0  |0  |0  |
   Destination-FQDN              |0-1|0-1|0-1|1  |1  |1  |0-1|1  |
   Destination-Realm             |0  |0  |0  |0  |1  |1  |1  |0  |
   DSI-Event                     |0  |1  |0  |0  |0  |0  |0  |0  |
   Error-Message                 |0  |0  |0  |0  |0-1|0  |0  |0  |
   Error-Reporting-FQDN          |0  |0  |0  |0  |1  |0  |0  |0  |
   Failed-AVP                    |0  |0  |0  |0  |0-1|0  |0  |0  |
   Failed-Command-Code           |0  |0  |0  |0  |0-1|0  |0  |0  |
   Firmware-Revision             |0-1|0  |0  |0  |0  |0  |0  |0  |
   Host-IP-Address               |1+ |0  |0  |0  |0  |0  |0  |0  |
   Max-Time-Wait                 |0  |0  |0  |0  |0  |0  |0  |0  |
   Origin-FQDN                   |1  |1  |1  |1  |1  |1  |1  |1  |
   Origin-Realm                  |1  |1  |1  |1  |1  |1  |1  |1  |
   Original-Session-Id           |0  |0  |0  |0  |0  |0  |0  |0  |
   Product-Name                  |1  |0  |0  |0  |0  |0  |0  |0  |
   Proxy-Info                    |0  |0  |0  |0  |0+ |0+ |0+ |0+ |
   Redirect-Host                 |0  |0  |0  |0  |0  |0  |0  |0  |
   Result-Code                   |0  |0  |0  |1  |1  |0  |0  |1  |
   Route-Record                  |0  |0  |0  |0  |0+ |0+ |0+ |0+ |
   Session-Id                    |0  |0-1|0  |0  |0-1|1  |1  |1  |
   Session-Timeout               |0  |0  |0  |0  |0  |0  |0  |0  |
   Supported-Vendor-Id           |0+ |0  |0  |0  |0  |0  |0  |0  |
   User-Name                     |0  |0  |0  |0  |0  |1  |1  |1  |
   Vendor-Id                     |1  |0  |0  |0  |0  |0  |0  |0  |
   ------------------------------|---+---+---+---+---+---+---+---|


16.2  Accounting AVP Table

   The table in this section is used to represent which AVPs defined in
   this document are to be present in the Accounting messages.














Calhoun et al.            expires October 2001                 [Page 76]





Internet-Draft                                                  May 2001


                                 +-----------------------+
                                 |      Command-Code     |
                                 |-----+-----+-----+-----+
   Attribute Name                | ACR | ACA | API | ASI |
   ------------------------------|-----+-----+-----+-----+
   Accounting-Interim-Interval   | 0-1 | 0-1 | 0   | 0   |
   Accounting-Record-Number      | 1   | 1   | 0   | 0   |
   Accounting-Record-Type        | 1   | 1   | 0   | 0   |
   Accounting-Session-Id         | 1   | 1   | 0   | 1   |
   Accounting-State              | 0   | 0   | 1   | 0   |
   Destination-FQDN              | 0+  | 1   | 0+  | 0-1 |
   Destination-Realm             | 1   | 0   | 1   | 1   |
   Error-Reporting-FQDN          | 0   | 0+  | 0   | 0   |
   Acct-Extension-Id             | 1   | 1   | 1   | 1   |
   Origin-FQDN                   | 1   | 1   | 1   | 1   |
   Origin-Realm                  | 1   | 1   | 1   | 1   |
   Proxy-Info                    | 0+  | 0+  | 0+  | 0+  |
   Route-Record                  | 0+  | 0+  | 0+  | 0+  |
   Result-Code                   | 0   | 1   | 0   | 0   |
   Session-Id                    | 1   | 1   | 0   | 1   |
   ------------------------------|-----+-----+-----+-----+


17.0  IANA Considerations

   This document defines a number of assigned numbers to be maintained
   by the IANA.  This section explains the criteria to be used by the
   IANA to assign additional numbers in each of these lists. The
   following subsections describe the assignment policy for the
   namespaces defined elsewhere in this document.


17.1  AVP

   As defined in section 4.0, the AVP header contains two fields that
   requires IANA namespace management; the AVP Code and Flags field.


17.1.1  AVP Code

   the AVP Code namespace is used to identify attributes. When the
   Vendor ID value is set to zero (0), IANA will maintain a registry of
   assigned AVP codes, and in some cases also their values. AVP Codes
   0-254 are managed separately as RADIUS Attribute Types [46], while
   the remaining namespace is available for assignment through
   Designated Expert [12].

   Vendor-Specific AVP Codes, where the Vendor-Id field in the AVP



Calhoun et al.            expires October 2001                 [Page 77]





Internet-Draft                                                  May 2001


   header is set to a non-zero value, is for Private Use.

   This document defines the AVP Codes 257-259, 260-272, 277-284, 291-
   297, 480, 482 and 485-486. See section 4.5 for the assignment of the
   namespace in this specification.


17.1.2  AVP Flags

   There are 16 bits in the AVP Flags field of the AVP header, defined
   in section 4.0. This document assigns bit 1 ('M'andatory), bit 3
   ('V'endor Specific) and bit 5 ('P'rotected). The remaining bits
   should only be assigned via a Standards Action [12].


17.2  Diameter Header

   As defined in section 3.0, the Diameter header contains two fields
   that require IANA namespace management; Command Code and Message
   Flags.


17.2.1  Command Codes

   The Command Code namespace is used to identify Diameter commands.
   The values 0-255 are reserved for RADIUS backward compatibility, and
   are defined as "RADIUS Packet Type Codes" in [46]. The remaining
   values are available via Standards Action [12].

   Vendor-Specific Command Codes, where the Vendor-Id field in the
   Diameter header is set to a non-zero value, is for Private Use.

   This document defines the Command Codes 257, 259, 271-276, 279-282.
   See section 3.1 for the assignment of the namespace in this
   specification.


17.2.2  Message Flags

   There are thirteen bits in the Flags field of the Diameter header.
   This document assigns bit 1 ('R'esponse), bit 2 ('I'nterrogation) and
   bit 3 ('E'xpected Reply). Bits 4 through 13 should only be assigned
   via a Standards Action [12].


17.3  Extension Identifiers

   As defined in section 6.1, the Extension Identifier is used to



Calhoun et al.            expires October 2001                 [Page 78]





Internet-Draft                                                  May 2001


   identify a specific Diameter Extension. All values, other than zero
   (0) are available for assignment via Standards Action [12].

   Note that the Diameter protocol is not intended to be extended for
   any purpose. Any extensions defined MUST ensure that they fit within
   the existing framework, and that no changes to the base protocol are
   required.


17.4  Result-Code AVP Values

   As defined in Section 10.2, the Result-Code AVP (AVP Code 268)
   defines the values 2001, 4001-4003 and 5001-5013.

   All remaining values are available for assignment via IETF Consensus
   [12].


17.5  DSI-Event AVP Values

   As defined in Section 9.1.1, the DSI-Event AVP (AVP Code 297) defines
   the values 1001, 3001, 4001 and 5001-5008. All remaining values are
   available for assignment via IETF Consensus [12].


17.6  Accounting-State AVP Values

   As defined in Section 15.4, the Accounting-State AVP (AVP Code 486)
   defines the values 1-2. All remaining values are available for
   assignment via IETF Consensus [12].


17.7  Accounting-Record-Type AVP Values

   As defined in Section 15.1, the Accounting-Record-Type AVP (AVP Code
   480) defines the values 1-4. All remaining values are available for
   assignment via IETF Consensus [12].


17.8  Diameter TCP/SCTP Port Numbers

   An IANA request has been placed for TCP and SCTP port numbers. The
   IANA has informed the authors that "TBD" should be used in section
   2.1 this document, and will be updated by the RFC editor during the
   RFC publication process.


18.0  Open Issues



Calhoun et al.            expires October 2001                 [Page 79]





Internet-Draft                                                  May 2001


   The following are the open issues that SHOULD be addressed in future
   versions of the Diameter protocol:

      - AVPs with time values are represented by Unsigned32 type data.
        This value is a timestamp consistent with NTP [18]. This field
        is expected to expire sometime in 2038. Future investigation
        SHOULD be done to determine if a 64 bit time format could be
        used.


19.0  Diameter protocol related configurable parameters

   This section contains the configurable parameters that are found
   throughout this document:

      Diameter Peer
         A Diameter entity MAY communicate with peers that are
         statically configured. A statically configured Diameter peer
         would require that either the IP address or the fully qualified
         domain name (FQDN) be supplied, which would then be used to
         resolve through DNS.

      Realm Routing Table
         A Diameter Proxy server routes messages based on the realm
         portion of a Network Access Identifier (NAI). The server MUST
         have a table of Realms Names, and the address of the peer to
         which the message must be forwarded to. The routing table MAY
         also include a "default route", which is typically used for all
         messages that cannot be locally processed.

      RTT-Multiplier
         The Round Trip Time Multiplier is used to determine when a DWR
         message is to be sent to an inactive peer. The recommended
         valus is 4.

      Watchdog Interval Period
         The Watchdog Interval Period is the frequency at which DWR
         messages are sent to inactive peers. The recommended value is
         30 seconds.


20.0  Security Considerations

   The Diameter base protocol assumes that messages are secured by using
   either IP Security, or TLS. This security model is acceptable in
   environments where there are no untrusted third party Diameter
   brokers, or redirect servers.




Calhoun et al.            expires October 2001                 [Page 80]





Internet-Draft                                                  May 2001


   When third party brokers or redirect servers are used, strong
   application level security SHOULD be required, such as non-
   repudiation.  When the communicating peers do require this level of
   security either for legal or business purposes, the extension defined
   in [11] MAY be used. This security model provides AVP-level
   authentication, and the encryption mechanism is designed such that
   only the target host has the keying information required to decrypt
   the information.


21.0  References


   [1]  C. Rigney, A. Rubens, W. Simpson, S. Willens, "Remote Authenti-
        cation Dial In User Service (RADIUS)", RFC 2865, June 2000.

   [2]  Reynolds, Postel, "Assigned Numbers", RFC 1700, October 1994.

   [3]  Postel, "User Datagram Protocol", RFC 768, August 1980.

   [4]  Rivest, "The MD5 Message-Digest Algorithm", RFC 1321, April
        1992.

   [5]  Kaufman, Perlman, Speciner, "Network Security: Private Communi-
        cations in a Public World", Prentice Hall, March 1995, ISBN 0-
        13-061466-1.

   [6]  Krawczyk, Bellare, Canetti, "HMAC: Keyed-Hashing for Message
        Authentication", RFC 2104, January 1997.

   [7]  P. Calhoun, W. Bulley, A. Rubens, J. Haag, "Diameter NASREQ
        Extension", draft-ietf-aaa-diameter-nasreq-03.txt, IETF work in
        progress, May 2001.

   [8]  Aboba, Beadles "The Network Access Identifier." RFC 2486. Janu-
        ary 1999.

   [10] P. Calhoun, C. Perkins, "Diameter Mobile IP Extensions", draft-
        ietf-aaa-diameter-mobileip-03.txt, IETF work in progress, May
        2001.

   [11] P. Calhoun, W. Bulley, S. Farrell, "Diameter End-2-End Security
        Extension", draft-ietf-aaa-diameter-e2e-sec-01.txt (work in pro-
        gress), May 2001.

   [12] Narten, Alvestrand,"Guidelines for Writing an IANA Considera-
        tions Section in RFCs", BCP 26, RFC 2434, October 1998




Calhoun et al.            expires October 2001                 [Page 81]





Internet-Draft                                                  May 2001


   [13] S. Bradner, "Key words for use in RFCs to Indicate Requirement
        Levels", BCP 14, RFC 2119, March 1997.

   [14] Myers, Ankney, Malpani, Galperin, Adams, "X.509 Internet Public
        Key Infrastructure Online Certificate Status Protocol (OCSP)",
        RFC 2560, June 1999.

   [15] D. Harkins, D. Carrel, "The Internet Key Exchange (IKE)", RFC
        2409, November 1998.

   [16] Hinden, Deering, "IP Version 6 Addressing Architecture", RFC
        2373, July 1998.

   [17] ISI, "Internet Protocol", RFC 791, September 1981.

   [18] Mills, "Simple Network Time Protocol (SNTP) Version 4 for IPv4,
        IPv6 and OSI, RFC 2030, October 1996.

   [19] Housley, Ford, Polk, Solo, "Internet X.509 Public Key Infras-
        tructure Certificate and CRL Profile", RFC 2459, January 1999.

   [20] B. Aboba, G. Zorn, "Criteria for Evaluating Roaming Protocols",
        RFC 2477, January 1999.

   [21] M. Beadles, D. Mitton, "Criteria for Evaluating Network Access
        Server Protocols", draft-ietf-nasreq-criteria-05.txt, IETF work
        in progress, June 2000.

   [22] T. Hiller and al, "CDMA2000 Wireless Data Requirements for AAA",
        draft-hiller-cdma2000-aaa-02.txt, IETF work in progress, Sep-
        tember 2000.

   [23] S. Glass, S. Jacobs, C. Perkins, "Mobile IP Authentication,
        Authorization, and Accounting Requirements". RFC 2977. October
        2000.

   [24] F. Yergeau, "UTF-8, a transformation format of ISO 10646", RFC
        2279, January 1998.

   [25] L. J. Blunk, J. R. Vollbrecht, "PPP Extensible Authentication
        Protocol (EAP)." RFC 2284, March 1998.

   [26] R. Stewart et al., "Stream Control Transmission Protocol". RFC
        2960.  October 2000.

   [27] Postel, J. "Transmission Control Protocol", RFC 793, January
        1981.




Calhoun et al.            expires October 2001                 [Page 82]





Internet-Draft                                                  May 2001


   [28] E. Guttman, C. Perkins, J. Veizades, M. Day. "Service Location
        Protocol, Version 2", RFC 2165, June 1999.

   [29] P. Calhoun, "Diameter Resource Management", draft-calhoun-
        diameter-res-mgmt-06.txt, IETF Work in Progress, February 2001.

   [30] Institute of Electrical and Electronics Engineers, "IEEE Stan-
        dard for Binary Floating-Point Arithmetic", ANSI/IEEE Standard
        754-1985, August 1985.

   [31] D. Crocker, P. Overell, "Augmented BNF for Syntax Specifica-
        tions:  ABNF", RFC 2234, November 1997.

   [32] E. Guttman, C. Perkins, J. Kempf, "Service Templates and Ser-
        vice: Schemes", RFC 2609, June 1999.

   [33] A. Gulbrandsen, P. Vixie, L. Esibov, "A DNS RR for specifying
        the location of services (DNS SRV)", RFC 2782, February 2000.

   [34] D. Eastlake, "Domain Name System Security Extensions", RFC 2535,
        March 1999.

   [35] D. Eastlake, "DNS Security Operational Considerations", RFC
        2541, March 1999.

   [36] D. Eastlake, "DNS Request and Transaction Signatures ( SIG(0)s
        )", RFC 2931, September 2000.

   [37] S. Kent, R. Atkinson, "Security Architecture for the Internet
        Protocol", RFC 2401, November 1998.

   [38] A. Frier, P. Karlton, and P. Kocher, "The SSL 3.0 Protocol",
        Netscape Communications Corp., Nov 18, 1996.

   [39] "The Communications of the ACM"  Vol.33, No.6 (June 1990), pp.
        677-680.

   [40] B. Aboba, J. Arkko, D. Harrington. "Introduction to Accounting
        Management", RFC 2975, October 2000.

   [41] A. Shacham, R. Monsour, R. Pereira, M. Thomas, "IP Payload
        Compression Protocol (IPComp)", RFC 2393, December 1998.

   [42] W. Simpson, "The Point-to-Point Protocol (PPP)", RFC 1661, STD
        51, July 1994.

   [43] B. Aboba, J. Lu, J. Alsop, J. Ding, W. Wang, "Review of Roaming
        Implementations", RFC 2194, September 1997.



Calhoun et al.            expires October 2001                 [Page 83]





Internet-Draft                                                  May 2001


   [44] B. Aboba, J. Vollbrecht, "Proxy Chaining and Policy Implementa-
        tion in Roaming", RFC 2607, June 1999.

   [45] C. Perkins, Editor.  IP Mobility Support.  RFC 2002, October
        1996.

   [46] IANA, "RADIUS Types", http://www.isi.edu/in-
        notes/iana/assignments/radius-types


22.0  Acknowledgements

   The authors would like to thank Nenad Trifunovic, Tony Johansson and
   Pankaj Patel for their participation in the pre-IETF Document Reading
   Party. Allison Mankin's assistance was invaluable in working out
   transport issues, and similarly with Steven Bellovin's help in the
   security area.

   Paul Funk and David Mitton were instrumental in getting the Peer
   State Machine correct, and our deep thanks go to them for their time.

   The authors would also like to acknowledge the following people for
   their contribution in the development of the Diameter protocol:

   Bernard Aboba, William Bulley, Mark Eklund, David Frascone, Daniel C.
   Fox, Lol Grant, Ignacio Goyret, Nancy Greene, Peter Heitman, Fredrik
   Johansson, Mark Jones, Martin Julien, Paul Krumviede, Fergal Ladley,
   Ryan Moats, Victor Muslin, Kenneth Peirce, Stephen Farrell, Sumit
   Vakil, John R. Vollbrecht, Jeff Weisberg and Jonathan Wood


23.0  Authors' Addresses

   Questions about this memo can be directed to:

      Pat R. Calhoun
      Network and Security Research Center, Sun Laboratories
      Sun Microsystems, Inc.
      15 Network Circle
      Menlo Park, California, 94025
      USA

       Phone:  +1 650-786-7733
         Fax:  +1 650-786-6445
      E-mail:  pcalhoun@eng.sun.com






Calhoun et al.            expires October 2001                 [Page 84]





Internet-Draft                                                  May 2001


      Haseeb Akhtar
      Wireless Technology Labs
      Nortel Networks
      2221 Lakeside Blvd.
      Richardson, TX 75082-4399
      USA

       Phone:  +1 972-684-8850
      E-Mail:  haseeb@nortelnetworks.com


      Jari Arkko
      Oy LM Ericsson Ab
      02420 Jorvas
      Finland

       Phone: +358 40 5079256
      E-Mail: Jari.Arkko@ericsson.com


      Erik Guttman
      Solaris Advanced Development
      Sun Microsystems, Inc.
      Eichhoelzelstr. 7
      74915 Waibstadt
      Germany

       Phone:  +49-7263-911-701
      E-mail:  erik.guttman@germany.sun.com


      Allan C. Rubens
      Tut Systems, Inc.
      220 E. Huron, Suite 260
      Ann Arbor, MI 48104
      USA

       Phone:  +1 734-995-1697
      E-Mail:  arubens@tutsys.com


      Glen Zorn
      Cisco Systems, Inc.
      500 108th Avenue N.E., Suite 500
      Bellevue, WA 98004
      USA

       Phone:  +1 425 438 8218



Calhoun et al.            expires October 2001                 [Page 85]





Internet-Draft                                                  May 2001


24.0  Full Copyright Statement

   Copyright (C) The Internet Society (2001).  All Rights Reserved.

   This document and translations of it may be copied and furnished to
   others, and derivative works that comment on or otherwise explain it
   or assist in its implementation may be prepared, copied, published
   and distributed, in whole or in part, without restriction of any
   kind, provided that the above copyright notice and this paragraph are
   included on all such copies and derivative works. However, this docu-
   ment itself may not be modified in any way, such as by removing the
   copyright notice or references to the Internet Society or other
   Internet organizations, except as needed for the purpose of develop-
   ing Internet standards in which case the procedures for copyrights
   defined in the Internet Standards process must be followed, or as
   required to translate it into languages other than English. The lim-
   ited permissions granted above are perpetual and will not be revoked
   by the Internet Society or its successors or assigns. This document
   and the information contained herein is provided on an "AS IS" basis
   and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DIS-
   CLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
   TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT
   INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR
   FITNESS FOR A PARTICULAR PURPOSE.


25.0  Expiration Date

   This memo is filed as <draft-ietf-aaa-diameter-03.txt> and expires in
   October 2001.





















Calhoun et al.            expires October 2001                 [Page 86]





Internet-Draft                                                  May 2001


Appendix A. Diameter Service Template

   The following service template describes the attributes used by Diam-
   eter servers to advertise themselves.  This simplifies the process of
   selecting an appropriate server to communicate with.  A Diameter
   client can request specific Diameter servers based on characteristics
   of the Diameter service desired (for example, an AAA server to use
   for accounting.)

   Name of submitter:  "Erik Guttman" <Erik.Guttman@sun.com>
   Language of service template:  en


   Security Considerations:
      Diameter clients and servers use various cryptographic mechanisms
      to protect communication integrity, confidentiality as well as
      perform end-point authentication.  It would thus be difficult if
      not impossible for an attacker to advertise itself using SLPv2 and
      pose as a legitimate Diameter peer without proper preconfigured
      secrets or cryptographic keys.  Still, as Diameter services are
      vital for network operation it is important to use SLPv2 authenti-
      cation to prevent an attacker from modifying or eliminating ser-
      vice advertisements for legitimate Diameter servers.

   Template text:
   -------------------------template begins here-----------------------
   template-type=service:diameter

   template-version=0.0

   template-description=
     The Diameter protocol is defined by draft-ietf-aaa-diameter-03.txt

   template-url-syntax=
     url-path= ; The standard service URL syntax is used.
               ; For example: 'service:diameter://aaa.example.com:1812















Calhoun et al.            expires October 2001                 [Page 87]





Internet-Draft                                                  May 2001


      supported-extensions= string L M
      # This attribute lists the Diameter extensions supported by the
      # AAA implementation.  The extensions currently defined are:
      #  Extension Name       Defined by
      #  ---------------      -----------------------------------
      #  NASREQ               draft-ietf-aaa-diameter-nasreq-03.txt
      #  MobileIP             draft-ietf-aaa-diameter-mobileip-03.txt
      #  Strong Security      draft-ietf-aaa-diameter-e2e-sec-00.txt
      #  Resource Management  draft-calhoun-diameter-res-mgmt-06.txt
      #
      # Notes:
      #   . Diameter implementations support one or more extensions.
      #   . Additional extensions may be defined in the future.
      #     An updated service template will be created at that time.
      #
      NASREQ,MobileIP,Accounting,Strong Security,Resource Management

      supported-transports= string L M
      SCTP
      # This attribute lists the supported transports that the Diameter
      # implementation accepts.  Note that a compliant Diameter
      # implementation MUST support SCTP, though it MAY support other
      # transports, too.
      SCTP,TCP

   -------------------------template ends here-----------------------

























Calhoun et al.            expires October 2001                 [Page 88]


